#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AppleARKit

#include "Basic.hpp"

#include "AppleARKit_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class AppleARKit.AppleARKitAnchor
// 0x0068 (0x0090 - 0x0028)
class UAppleARKitAnchor : public UObject
{
public:
	struct FGuid                                  Identifier;                                        // 0x0028(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FD4[0x58];                                     // 0x0038(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FTransform GetTransform() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppleARKitAnchor">();
	}
	static class UAppleARKitAnchor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppleARKitAnchor>();
	}
};

// Class AppleARKit.AppleARKitBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAppleARKitBlueprintLibrary final  : public UBlueprintFunctionLibrary
{
public:
	static bool GetCurrentFrame(class UObject* WorldContextObject, struct FAppleARKitFrame* OutCurrentFrame);
	static bool HitTestAtScreenPosition_TrackingSpace(class UObject* WorldContextObject, struct FVector2D& ScreenPosition, EAppleARKitHitTestResultType Types, TArray<struct FAppleARKitHitTestResult>* OutResults);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppleARKitBlueprintLibrary">();
	}
	static class UAppleARKitBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppleARKitBlueprintLibrary>();
	}
};

// Class AppleARKit.AppleARKitPlaneAnchor
// 0x0020 (0x00B0 - 0x0090)
class UAppleARKitPlaneAnchor final  : public UAppleARKitAnchor
{
public:
	uint8                                         Pad_FD9[0x20];                                     // 0x0090(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetCenter() const;
	struct FVector GetExtent() const;
	struct FTransform GetTransformToCenter() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppleARKitPlaneAnchor">();
	}
	static class UAppleARKitPlaneAnchor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppleARKitPlaneAnchor>();
	}
};

// Class AppleARKit.ARKitCameraOverlayMaterialLoader
// 0x0008 (0x0030 - 0x0028)
class UARKitCameraOverlayMaterialLoader final  : public UObject
{
public:
	class UMaterialInterface*                     DefaultCameraOverlayMaterial;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARKitCameraOverlayMaterialLoader">();
	}
	static class UARKitCameraOverlayMaterialLoader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARKitCameraOverlayMaterialLoader>();
	}
};

// Class AppleARKit.MaterialExpressionARKitPassthroughCamera
// 0x0038 (0x0078 - 0x0040)
class UMaterialExpressionARKitPassthroughCamera final  : public UMaterialExpression
{
public:
	struct FExpressionInput                       Coordinates;                                       // 0x0040(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	uint32                                        ConstCoordinate;                                   // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EARKitTextureType                             TextureType;                                       // 0x0074(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FDA[0x3];                                      // 0x0075(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionARKitPassthroughCamera">();
	}
	static class UMaterialExpressionARKitPassthroughCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionARKitPassthroughCamera>();
	}
};

}

