#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AppleARKit

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AugmentedReality_structs.hpp"


namespace SDK
{

// Enum AppleARKit.EAppleARKitHitTestResultType
// NumValues: 0x0006
enum class EAppleARKitHitTestResultType : uint8
{
	None                                     = 0,
	FeaturePoint                             = 1,
	EstimatedHorizontalPlane                 = 2,
	ExistingPlane                            = 4,
	ExistingPlaneUsingExtent                 = 8,
	EAppleARKitHitTestResultType_MAX         = 9,
};

// Enum AppleARKit.EARKitTextureType
// NumValues: 0x0003
enum class EARKitTextureType : uint8
{
	TextureY                                 = 0,
	TextureCbCr                              = 1,
	EARKitTextureType_MAX                    = 2,
};

// ScriptStruct AppleARKit.AppleARKitCamera
// 0x0080 (0x0080 - 0x0000)
struct FAppleARKitCamera final 
{
public:
	EARTrackingQuality                            TrackingQuality;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FCD[0xF];                                      // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FQuat                                  Orientation;                                       // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Translation;                                       // 0x0050(0x000C)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ImageResolution;                                   // 0x005C(0x0008)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              FocalLength;                                       // 0x0064(0x0008)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              PrincipalPoint;                                    // 0x006C(0x0008)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FCE[0xC];                                      // 0x0074(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AppleARKit.AppleARKitFrame
// 0x00B0 (0x00B0 - 0x0000)
struct alignas(0x10) FAppleARKitFrame final 
{
public:
	uint8                                         Pad_FCF[0xB0];                                     // 0x0000(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AppleARKit.AppleARKitHitTestResult
// 0x0050 (0x0050 - 0x0000)
struct FAppleARKitHitTestResult final 
{
public:
	EAppleARKitHitTestResultType                  Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FD0[0x3];                                      // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Distance;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FD1[0x8];                                      // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UAppleARKitAnchor*                      Anchor;                                            // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FD2[0x8];                                      // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AppleARKit.AppleARKitLightEstimate
// 0x0008 (0x0008 - 0x0000)
struct FAppleARKitLightEstimate final 
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FD3[0x3];                                      // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AmbientIntensity;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

