#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_PartySuggestion

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Athena_PartySuggestion.Athena_PartySuggestion_C
// 0x01B8 (0x03C0 - 0x0208)
class UAthena_PartySuggestion_C final  : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0218(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0220(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthena_PartyIconsDisplay_C*            Athena_PartyIconsDisplay;                          // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_2isLFG;                            // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               O_Master;                                          // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_LFG_PartyFillType;                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_PartyName;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Status;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   PartyFocused;                                      // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsActive;                                         // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2003[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CurDisplayedPlayerName;                            // 0x0290(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurPartySize;                                      // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCurIsLFG;                                         // 0x02AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2004[0x3];                                     // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Timer_AnimOutro;                                   // 0x02B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bPartySuggestionInQueue;                           // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2005[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnSuggestionMouseDown;                             // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FFortPartySuggestion                   NewPartyStruct;                                    // 0x02D0(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortPartySuggestion                   CurPartyStruct;                                    // 0x0348(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void PartyFocused__DelegateSignature(class UAthena_LFG_SuggestedPartyItem_C* FocusedPartyItem);
	void OnSuggestionMouseDown__DelegateSignature();
	void ExecuteUbergraph_Athena_PartySuggestion(int32 EntryPoint, int32 Temp_int_Variable, int32 Temp_int_Variable1, int32 Temp_int_Variable12, class FText Temp_text_Variable, class FText Temp_text_Variable1, class FText Temp_text_Variable12, class FText Temp_text_Variable123, class FText Temp_text_Variable1234, bool Temp_bool_Variable, int32 Temp_int_Variable123, int32 Temp_int_Variable1234, bool Temp_bool_Variable1, int32 Temp_int_Variable12345, TArray<class UFortSocialItem*>& CallFunc_Map_Values_Values, class UFortSocialItem* CallFunc_Array_Get_Item, int32 CallFunc_Map_Length_ReturnValue, class FText CallFunc_GetDisplayName_ReturnValue, bool Temp_bool_Variable12, const struct FLinearColor& Temp_struct_Variable, const struct FLinearColor& Temp_struct_Variable1, bool Temp_bool_Variable123, int32 Temp_int_Variable123456, int32 Temp_int_Variable1234567, bool CallFunc_RandomBool_ReturnValue, const struct FFortPartySuggestion& K2Node_CustomEvent_Party_Suggestion_Struct, const struct FFortPartySuggestion& K2Node_CustomEvent_PartySuggestionStruct, bool CallFunc_Greater_IntInt_ReturnValue, bool K2Node_Event_IsDesignTime, int32 K2Node_Select_Default, float CallFunc_GetEndTime_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_K2_IsTimerActiveHandle_ReturnValue, bool Temp_bool_Variable1234, int32 K2Node_Select1_Default, int32 CallFunc_RandomIntegerInRange_ReturnValue, class FText K2Node_Select12_Default, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, const struct FDateTime& CallFunc_DateTimeMinValue_ReturnValue, bool CallFunc_NotEqual_DateTimeDateTime_ReturnValue, int32 K2Node_Select123_Default, int32 K2Node_Select1234_Default, const struct FLinearColor& K2Node_Select12345_Default);
	void ClobberSuggestion();
	void DismissSuggestion();
	void PlayIntro();
	void OnHovered();
	void OnUnhovered();
	void HidePartySuggestion();
	void PlayOutro();
	void PreConstruct(bool IsDesignTime);
	void InitNewPartySuggestion(const struct FFortPartySuggestion& NewPartySuggestion);
	void NewPartySuggestion(const struct FFortPartySuggestion& Party_Suggestion_Struct);
	struct FEventReply OnMouseButtonDown_0(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void UpdateDisplay();
	void UpdatePartySuggestion(const struct FFortPartySuggestion& PartySuggestionStruct);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_PartySuggestion_C">();
	}
	static class UAthena_PartySuggestion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthena_PartySuggestion_C>();
	}
};

}

