#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingOptionsDisplay_v2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C
// 0x00D8 (0x04C0 - 0x03E8)
class UAthenaMatchmakingOptionsDisplay_v2_C final  : public UFortActivatablePanel
{
public:
	uint8                                         Pad_3038[0x8];                                     // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn_Details;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   B_GM_Duo;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   B_GM_LTM;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   B_GM_Solo;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   B_GM_Squad;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_0;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          ClickBlocker;                                      // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CT_HoveredGameMode;                                // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CT_HoveredModeDescription;                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_Content;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_GameModeContainer;                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Input_Cancel;                                      // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UAthenaMatchmakingPlay_C*               Parent;                                            // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           DebugList_StandardModes;                           // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UAthena_Matchmaking_GameModeButton_C*> MyStandardGameModeButtons;                         // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UAthena_Matchmaking_SpecialEventButton_C* MyLTM;                                             // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastHoveredStandardModeIndex;                      // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3039[0x4];                                     // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAthena_Matchmaking_GameModeButton_C*> MyActiveStandardGameModeButtons;                   // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         SM_Button_IndexMax;                                // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SM_Button_IndexCurrent;                            // 0x04B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortAthenaPlaylist                           LTMPlaylist;                                       // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2(int32 EntryPoint, class UFortUINavigationManager* CallFunc_GetUINavigationManager_ReturnValue, TArray<class UAthena_Matchmaking_GameModeButton_C*>& K2Node_MakeArray_Array, class UAthena_Matchmaking_GameModeButton_C* K2Node_CustomEvent_SelectedGameModeButton, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue1, bool CallFunc_SetCurrentPlaylist_ReturnValue, float CallFunc_GetEndTime_ReturnValue, class UAthena_Matchmaking_GameModeButton_C* K2Node_CustomEvent_HoveredButton, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_IsValid_ReturnValue12, TArray<EFortAthenaPlaylist>& CallFunc_GetActivePlaylists_ReturnValue, class UCommonButton* K2Node_ComponentBoundEvent_Button, class UAthena_Matchmaking_GameModeButton_C* CallFunc_Array_Get_Item, bool CallFunc_IsValid_ReturnValue123);
	void Destruct();
	void PlaylistsUpdated();
	void OnModeButtonHovered(class UAthena_Matchmaking_GameModeButton_C* HoveredButton);
	void OnGameModeButtonSelected(class UAthena_Matchmaking_GameModeButton_C* SelectedGameModeButton);
	void Construct();
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnActivated();
	void SetupInput(TDelegate<void(bool* bPassThrough)> K2Node_CreateDelegate_OutputDelegate);
	void Handle_InputAction_Cancel(bool* Passthrough);
	void CloseMatchmakingOptions(class UFortUIManagerWidget_NUI* CallFunc_GetUIManagerWidget_ReturnValue);
	void AddStandardGameModes(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UAthena_Matchmaking_GameModeButton_C* CallFunc_Create_ReturnValue, class FText CallFunc_Array_Get_Item, int32 CallFunc_Array_Add_ReturnValue, class UPanelSlot* CallFunc_AddChild_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void ClearStandardGameModes();
	void AddLTM(EFortAthenaPlaylist Param_LTMPlaylist, bool AddSpecialStyle, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UAthena_Matchmaking_GameModeButton_C* CallFunc_Create_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, class UPanelSlot* CallFunc_AddChild_ReturnValue);
	void ClearLTM();
	class UWidget* Handle_Navigate_Right(EUINavigation Param_Navigation, EUINavigation Temp_byte_Variable, class UWidget* Temp_object_Variable, class UWidget* Temp_object_Variable1, class UWidget* Temp_object_Variable12, class UWidget* Temp_object_Variable123, class UWidget* Temp_object_Variable1234, class UWidget* Temp_object_Variable12345, class UWidget* K2Node_Select_Default);
	class UWidget* Handle_Navigate_Left(EUINavigation Param_Navigation, bool Temp_bool_Variable, EUINavigation Temp_byte_Variable, class UWidget* Temp_object_Variable, class UWidget* Temp_object_Variable1, class UWidget* Temp_object_Variable12, class UWidget* Temp_object_Variable123, class UWidget* Temp_object_Variable1234, class UAthena_Matchmaking_GameModeButton_C* CallFunc_Array_Get_Item, bool CallFunc_IsValid_ReturnValue, class UWidget* K2Node_Select_Default, class UWidget* K2Node_Select1_Default);
	void SetupButtonBindings(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TDelegate<void(class UAthena_Matchmaking_GameModeButton_C* HoveredButton)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(class UAthena_Matchmaking_GameModeButton_C* SelectedGameModeButton)> K2Node_CreateDelegate_OutputDelegate1, class UAthena_Matchmaking_GameModeButton_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void UpdateStandardGameModeButtonAvailibilty(int32 Temp_int_Variable, int32 Temp_int_Variable1, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue1, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue12, class UAthena_Matchmaking_GameModeButton_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue1, bool CallFunc_Less_IntInt_ReturnValue, class UAthena_Matchmaking_GameModeButton_C* CallFunc_Array_Get_Item1, class UAthena_Matchmaking_GameModeButton_C* CallFunc_Array_Get_Item12, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Length_ReturnValue12, bool CallFunc_Less_IntInt_ReturnValue1, int32 CallFunc_Array_Length_ReturnValue123, bool CallFunc_Less_IntInt_ReturnValue12);
	class UWidget* Handle_Navigate_StandardModes_Up(EUINavigation Param_Navigation, EUINavigation Temp_byte_Variable, class UWidget* Temp_object_Variable, class UWidget* Temp_object_Variable1, class UWidget* Temp_object_Variable12, class UWidget* Temp_object_Variable123, class UWidget* Temp_object_Variable1234, int32 CallFunc_HandleStandardModeButtonIndex_NewIndex, class UAthena_Matchmaking_GameModeButton_C* CallFunc_Array_Get_Item, class UWidget* K2Node_Select_Default);
	class UWidget* Handle_Navigate_StandardModes_Down(EUINavigation Param_Navigation, EUINavigation Temp_byte_Variable, class UWidget* Temp_object_Variable, class UWidget* Temp_object_Variable1, class UWidget* Temp_object_Variable12, class UWidget* Temp_object_Variable123, class UWidget* Temp_object_Variable1234, int32 CallFunc_HandleStandardModeButtonIndex_NewIndex, class UAthena_Matchmaking_GameModeButton_C* CallFunc_Array_Get_Item, class UWidget* K2Node_Select_Default);
	void HandleStandardModeButtonIndex(bool Increment, int32* NewIndex, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue);
	void UpdateLTM(int32 Temp_int_Array_Index_Variable, TArray<EFortAthenaPlaylist>& CallFunc_GetActivePlaylists_ReturnValue, int32 Temp_int_Loop_Counter_Variable, EFortAthenaPlaylist CallFunc_Array_Get_Item, bool CallFunc_NotEqual_ByteByte_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue1, bool CallFunc_NotEqual_ByteByte_ReturnValue12, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue1, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue1, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue1, bool CallFunc_IsValid_ReturnValue);
	void NoLTMAvailable();
	void InitializeGameModeButtons(bool CallFunc_IsBROnly_ReturnValue);
	struct FEventReply On_ClickBlocker_MouseButtonDown_0(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchmakingOptionsDisplay_v2_C">();
	}
	static class UAthenaMatchmakingOptionsDisplay_v2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchmakingOptionsDisplay_v2_C>();
	}
};

}

