#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaChallengesTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaChallengesTab.AthenaChallengesTab_C
// 0x0040 (0x0440 - 0x0400)
class UAthenaChallengesTab_C final  : public UAthenaChallengeBundleScheduleScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UCommonWidgetSwitcher*                  ScheduleSwitcher;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalTabList_C*                   ScheduleTabList;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UFortChallengeBundleScheduleDefinition*> UnlockableBundles;                                 // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UFortChallengeBundleScheduleItem*> ActiveBundles;                                     // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   LastActiveTab;                                     // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaChallengesTab(int32 EntryPoint, class UFortFrontEndContext* CallFunc_GetContext_ReturnValue, class FName K2Node_ComponentBoundEvent_TabId1, class FName K2Node_ComponentBoundEvent_TabId, class UCommonButton* K2Node_ComponentBoundEvent_TabButton, TDelegate<void(class UFortItem* Item)> K2Node_CreateDelegate_OutputDelegate, class UFortFrontEndContext* CallFunc_GetContext_ReturnValue1);
	void BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature(class FName TabId);
	void OnDeactivated();
	void OnActivated();
	void Construct();
	void RegisterEventListeners(TDelegate<void()> K2Node_CreateDelegate_OutputDelegate);
	void HandleChallengesChanged();
	void UpdateChallengeViews(const TArray<class UFortChallengeBundleScheduleItem*>& Schedules, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, TArray<class UFortChallengeBundleScheduleItem*>& CallFunc_GetChallengeBundleSchedules_OutActiveBundles, TArray<class UFortChallengeBundleScheduleDefinition*>& CallFunc_GetChallengeBundleSchedules_OutUnlockableBundles, int32 Temp_int_Array_Index_Variable1, class UFortChallengeBundleScheduleDefinition* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UFortChallengeBundleScheduleItem* CallFunc_Array_Get_Item1, class UChallengeBundleScheduleDisplay_C* CallFunc_Create_ReturnValue, class UFortChallengeBundleScheduleDefinition* CallFunc_GetScheduleDefinitionBP_ReturnValue, int32 CallFunc_Array_Length_ReturnValue1, int32 Temp_int_Loop_Counter_Variable1, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue1, int32 CallFunc_Add_IntInt_ReturnValue1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue1, class UChallengeBundleScheduleDisplay_C* CallFunc_Create_ReturnValue1);
	void CreateTab(class UFortChallengeBundleScheduleDefinition* ScheduleDefinition, class UWidget* ContentWidget, class FText CallFunc_GetDisplayName_ReturnValue, const class FString& CallFunc_GetPersistentName_ReturnValue, const struct FFortTabButtonLabelInfo& K2Node_MakeStruct_FortTabButtonLabelInfo, class FName CallFunc_Conv_StringToName_ReturnValue, bool CallFunc_RegisterFortTab_ReturnValue, class UPanelSlot* CallFunc_AddChild_ReturnValue);
	void ResetTabs();
	void HandleTabSelected(class FName TabId, class FName CallFunc_GetActiveTab_ReturnValue);
	void HandleTabButtonCreated(class FName TabId, class UCommonButton* Button, class UCommonButton* LocalTab, class FName LocalTabId, class UIconTabButton_C* K2Node_DynamicCast_AsIcon_Tab_Button, bool K2Node_DynamicCast_bSuccess, class FText CallFunc_TextToUpper_ReturnValue);
	void SetupViewedItemData(class UFortItem* Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaChallengesTab_C">();
	}
	static class UAthenaChallengesTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaChallengesTab_C>();
	}
};

}

