#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AugmentedReality

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AugmentedReality_structs.hpp"


namespace SDK
{

// Class AugmentedReality.ARBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UARBlueprintLibrary final  : public UBlueprintFunctionLibrary
{
public:
	static void DebugDrawTrackedGeometry(class UARTrackedGeometry* TrackedGeometry, class UObject* WorldContextObject, const struct FLinearColor& Color, float OutlineThickness, float PersistForSeconds);
	static TArray<class UARTrackedGeometry*> GetAllGeometries();
	static struct FTransform GetLocalToTrackingTransform(struct FARTraceResult& TraceResult);
	static struct FTransform GetLocalToWorldTransform(struct FARTraceResult& TraceResult);
	static class UARTrackedGeometry* GetTrackedGeometry(struct FARTraceResult& TraceResult);
	static EARTrackingQuality GetTrackingQuality();
	static bool IsARActive();
	static TArray<struct FARTraceResult> LineTraceTrackedObjects(struct FVector2D& ScreenCoord);
	static bool StartAR();
	static void StopAR();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARBlueprintLibrary">();
	}
	static class UARBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARBlueprintLibrary>();
	}
};

// Class AugmentedReality.ARTrackedGeometry
// 0x0010 (0x0038 - 0x0028)
class UARTrackedGeometry : public UObject
{
public:
	uint8                                         Pad_2412[0x10];                                    // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARTrackedGeometry">();
	}
	static class UARTrackedGeometry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARTrackedGeometry>();
	}
};

// Class AugmentedReality.ARPlaneGeometry
// 0x0058 (0x0090 - 0x0038)
class UARPlaneGeometry final  : public UARTrackedGeometry
{
public:
	uint8                                         Pad_2413[0x8];                                     // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalToTrackingTransform;                          // 0x0040(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FVector                                Center;                                            // 0x0070(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                Extent;                                            // 0x007C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2414[0x8];                                     // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetCenter() const;
	struct FVector GetExtent() const;
	struct FTransform GetLocalToTrackingTransform() const;
	struct FTransform GetLocalToWorldTransform() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARPlaneGeometry">();
	}
	static class UARPlaneGeometry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARPlaneGeometry>();
	}
};

}

