#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AugmentedReality

#include "Basic.hpp"

#include "AugmentedReality_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AugmentedReality.ARBlueprintLibrary.DebugDrawTrackedGeometry
// 0x0028 (0x0028 - 0x0000)
struct ARBlueprintLibrary_DebugDrawTrackedGeometry final 
{
public:
	class UARTrackedGeometry*                     TrackedGeometry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutlineThickness;                                  // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PersistForSeconds;                                 // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetAllGeometries
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllGeometries final 
{
public:
	TArray<class UARTrackedGeometry*>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetLocalToTrackingTransform
// 0x0080 (0x0080 - 0x0000)
struct ARBlueprintLibrary_GetLocalToTrackingTransform final 
{
public:
	struct FARTraceResult                         TraceResult;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0050(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetLocalToWorldTransform
// 0x0080 (0x0080 - 0x0000)
struct ARBlueprintLibrary_GetLocalToWorldTransform final 
{
public:
	struct FARTraceResult                         TraceResult;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0050(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetTrackedGeometry
// 0x0060 (0x0060 - 0x0000)
struct ARBlueprintLibrary_GetTrackedGeometry final 
{
public:
	struct FARTraceResult                         TraceResult;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UARTrackedGeometry*                     ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2411[0x8];                                     // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AugmentedReality.ARBlueprintLibrary.GetTrackingQuality
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_GetTrackingQuality final 
{
public:
	EARTrackingQuality                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.IsARActive
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_IsARActive final 
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.LineTraceTrackedObjects
// 0x0018 (0x0018 - 0x0000)
struct ARBlueprintLibrary_LineTraceTrackedObjects final 
{
public:
	struct FVector2D                              ScreenCoord;                                       // 0x0000(0x0008)(ConstParm, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FARTraceResult>                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.StartAR
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_StartAR final 
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPlaneGeometry.GetCenter
// 0x000C (0x000C - 0x0000)
struct ARPlaneGeometry_GetCenter final 
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPlaneGeometry.GetExtent
// 0x000C (0x000C - 0x0000)
struct ARPlaneGeometry_GetExtent final 
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPlaneGeometry.GetLocalToTrackingTransform
// 0x0030 (0x0030 - 0x0000)
struct ARPlaneGeometry_GetLocalToTrackingTransform final 
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPlaneGeometry.GetLocalToWorldTransform
// 0x0030 (0x0030 - 0x0000)
struct ARPlaneGeometry_GetLocalToWorldTransform final 
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

}

