#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Post_SupplyDrop_Impact

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Post_Explosion_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Post_SupplyDrop_Impact.B_Post_SupplyDrop_Impact_C
// 0x0020 (0x08B0 - 0x0890)
class AB_Post_SupplyDrop_Impact_C final  : public AB_Post_Explosion_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0890(0x0008)(Transient, DuplicateTransient)
	float                                         Timeline_0_BlendWeight_69D06A67407476376496A4814EB654AE; // 0x0898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_69D06A67407476376496A4814EB654AE; // 0x089C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4418[0x3];                                     // 0x089D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Post_SupplyDrop_Impact(int32 EntryPoint, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue1, float CallFunc_Multiply_FloatFloat_ReturnValue12, float K2Node_CustomEvent_PostFX_BoxScaleDyn, const struct FVector& K2Node_CustomEvent_PostFX_CamShakeLoc, bool K2Node_CustomEvent_PostFX_UseCamShake, float K2Node_CustomEvent_PostFX_DeactivateDelay, bool K2Node_CustomEvent_PostFX_UseForceFeedback, const struct FVector& CallFunc_MakeVector_ReturnValue);
	void SpawnPostFX(float PostFX_BoxScaleDyn, const struct FVector& PostFX_CamShakeLoc, bool PostFX_UseCamShake, float PostFX_DeactivateDelay, bool PostFX_UseForceFeedback);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Post_SupplyDrop_Impact_C">();
	}
	static class AB_Post_SupplyDrop_Impact_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Post_SupplyDrop_Impact_C>();
	}
};

}

