#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExpeditionSquadSlotsView

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ExpeditionSquadSlotsView.BP_ExpeditionSquadSlotsView_C
// 0x0040 (0x0338 - 0x02F8)
class UBP_ExpeditionSquadSlotsView_C final  : public UFortSquadSlotsView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(Transient, DuplicateTransient)
	class USquadSlotGroup_C*                      SubordinatesSquadSlotGroup;                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnSquadSlotSelected;                               // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bShowHeader;                                       // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSelectableButtons;                                // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4076[0x6];                                     // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnSquadSlotOpened;                                 // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EFortItemCardSize                             Slot_Size;                                         // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnSquadSlotSelected__DelegateSignature(int32 SquadSlotIndex);
	void OnSquadSlotOpened__DelegateSignature();
	void ExecuteUbergraph_BP_ExpeditionSquadSlotsView(int32 EntryPoint, bool K2Node_Event_IsDesignTime, int32 K2Node_CustomEvent_SquadSlotIndex1, TDelegate<void(int32 SquadSlotIndex)> K2Node_CreateDelegate_OutputDelegate, int32 K2Node_CustomEvent_SquadSlotIndex);
	void Destruct();
	void Construct();
	void OpenSquadSlotEvent(int32 SquadSlotIndex);
	void HandleSquadSlotOpened();
	void PreConstruct(bool IsDesignTime);
	void HandleSquadSlotSelected(int32 SquadSlotIndex);
	class UFortSquadSlotSelectorButton* CreateAndAddSquadSlotButton(int32 SquadSlotIndex, struct FHomebaseSquadSlot& SquadSlotDefinition, class UWidget** OutSquadSlotButtonHost, bool CallFunc_EqualEqual_IntInt_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UExpeditionSquadSlotButton_C* CallFunc_Create_ReturnValue, TArray<class UWidget*>& K2Node_MakeArray_Array, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(int32 SquadSlotIndex)> K2Node_CreateDelegate_OutputDelegate1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ExpeditionSquadSlotsView_C">();
	}
	static class UBP_ExpeditionSquadSlotsView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ExpeditionSquadSlotsView_C>();
	}
};

}

