#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestExpiresWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_QuestExpiresWidget.BP_QuestExpiresWidget_C
// 0x0020 (0x0240 - 0x0220)
class UBP_QuestExpiresWidget_C final  : public UFortQuestExpiresWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       QuestExpires;                                      // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 Style;                                             // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bBreifText;                                        // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bTempDoesExpire;                                   // 0x0239(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_QuestExpiresWidget(int32 EntryPoint, ESlateVisibility Temp_byte_Variable, bool CallFunc_DoesQuestExpire_ReturnValue, ESlateVisibility Temp_byte_Variable1, bool K2Node_Event_IsDesignTime, class UFortQuestItem* K2Node_Event_InItem, bool Temp_bool_Variable, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue1, bool CallFunc_BooleanAND_ReturnValue, ESlateVisibility K2Node_Select_Default);
	void OnQuestExpirationUpdated();
	void SetData(class UFortQuestItem* InItem);
	void PreConstruct(bool IsDesignTime);
	void Refresh_Expiration_Timer(class UFortQuestItem* Quest, bool Temp_bool_Variable, bool CallFunc_DoesQuestExpire_ReturnValue, class AFortPlayerController* CallFunc_GetFortPC_AsFort_Player_Controller, const struct FDateTime& CallFunc_GetMcpRelativeUtcNow_ReturnValue, const struct FTimespan& CallFunc_GetRemainingExpirationDuration_ReturnValue, class FText CallFunc_GetTimespanAsText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array1, class FText CallFunc_Format_ReturnValue, class FText CallFunc_Format_ReturnValue1, class FText K2Node_Select_Default);
	void GetFortPC(class AFortPlayerController** AsFort_Player_Controller, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AFortPlayerController* K2Node_DynamicCast_AsFort_Player_Controller, bool K2Node_DynamicCast_bSuccess);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_QuestExpiresWidget_C">();
	}
	static class UBP_QuestExpiresWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestExpiresWidget_C>();
	}
};

}

