#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SurvivorAnchor

#include "Basic.hpp"

#include "SurvivorAnchorMaxZMove_structs.hpp"
#include "SurvivorAnchorHeightEnum_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SurvivorAnchorWidthEnum_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SurvivorAnchor.BP_SurvivorAnchor_C
// 0x00A0 (0x0EA0 - 0x0E00)
class ABP_SurvivorAnchor_C final  : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E00(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SurvivorAnchorBoxMesh;                             // 0x0E08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        SurvivorPawnSpawnRotationArrow;                    // 0x0E10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    SurvivorPawnSpawnIcon;                             // 0x0E18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    SurvivorAnchorIcon;                                // 0x0E20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SurvivorAnchorBox;                                 // 0x0E28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0E30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ESurvivorAnchorHeightEnum                     SurvivorAnchorHeightInBuildingTiles;               // 0x0E31(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESurvivorAnchorWidthEnum                      SurvivorAnchorWidthInBuildingTiles;                // 0x0E32(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESurvivorAnchorMaxZMove                       SurvivorAnchorMaxZMoveInTiles;                     // 0x0E33(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AnchorBoxCenter;                                   // 0x0E34(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AnchorBoxBounds;                                   // 0x0E40(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A3[0x4];                                     // 0x0E4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivor_C*                            SurvivorAnchorPawn;                                // 0x0E50(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SurvivorPawnLocation;                              // 0x0E58(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SurvivorPawnRotationWidget;                        // 0x0E64(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               SurvivorPawnRotation;                              // 0x0E70(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A4[0x4];                                     // 0x0E7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 SurvivorAnchorPawnClassToSpawn;                    // 0x0E80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWeaponItemDefinition*              SurvivorWeaponDataOverride;                        // 0x0E88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortTeam                                     SurvivorTeamOverride;                              // 0x0E90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortressAIType                               SurvivorAITypeOverride;                            // 0x0E91(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnASurvivor;                                    // 0x0E92(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A5[0x1];                                     // 0x0E93(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnchorEQSGridSize;                                 // 0x0E94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnchorEQSGridSpaceBetween;                         // 0x0E98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SurvivorAnchor(int32 EntryPoint, bool CallFunc_IsValid_ReturnValue, class ASurvivor_C* K2Node_DynamicCast_AsSurvivor, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValidClass_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue1, const struct FHitResult& CallFunc_K2_SetWorldRotation_SweepHitResult, const struct FHitResult& CallFunc_K2_SetWorldLocation_SweepHitResult, class AController* CallFunc_GetController_ReturnValue, class AFortAIController* K2Node_DynamicCast_AsFort_AIController, bool K2Node_DynamicCast_bSuccess1, class AFortWeapon* CallFunc_EquipWeaponDefinition_ReturnValue, bool CallFunc_IsValid_ReturnValue1, bool CallFunc_IsValid_ReturnValue12, class ACharacter* CallFunc_GetPlayerCharacter_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, bool CallFunc_IsValid_ReturnValue123, class ASurvivor_C* CallFunc_FinishSpawningActor_ReturnValue);
	void ShowAnchorBounds();
	void ReceiveBeginPlay();
	void UserConstructionScript(float Temp_float_Variable, float Temp_float_Variable1, float Temp_float_Variable12, float Temp_float_Variable123, float Temp_float_Variable1234, float Temp_float_Variable12345, float Temp_float_Variable123456, float Temp_float_Variable1234567, float Temp_float_Variable12345678, float Temp_float_Variable123456789, ESurvivorAnchorHeightEnum Temp_byte_Variable, float Temp_float_Variable12345678910, float Temp_float_Variable1234567891011, float Temp_float_Variable123456789101112, float Temp_float_Variable12345678910111213, float Temp_float_Variable1234567891011121314, float Temp_float_Variable123456789101112131415, float Temp_float_Variable12345678910111213141516, float Temp_float_Variable1234567891011121314151617, float Temp_float_Variable123456789101112131415161718, float Temp_float_Variable12345678910111213141516171819, ESurvivorAnchorWidthEnum Temp_byte_Variable1, float Temp_float_Variable1234567891011121314151617181920, float Temp_float_Variable123456789101112131415161718192021, float Temp_float_Variable12345678910111213141516171819202122, float Temp_float_Variable1234567891011121314151617181920212223, float Temp_float_Variable123456789101112131415161718192021222324, float Temp_float_Variable12345678910111213141516171819202122232425, float Temp_float_Variable1234567891011121314151617181920212223242526, float Temp_float_Variable123456789101112131415161718192021222324252627, float Temp_float_Variable12345678910111213141516171819202122232425262728, float Temp_float_Variable1234567891011121314151617181920212223242526272829, ESurvivorAnchorWidthEnum Temp_byte_Variable12, float Temp_float_Variable123456789101112131415161718192021222324252627282930, float Temp_float_Variable12345678910111213141516171819202122232425262728293031, float Temp_float_Variable1234567891011121314151617181920212223242526272829303132, float Temp_float_Variable123456789101112131415161718192021222324252627282930313233, float Temp_float_Variable12345678910111213141516171819202122232425262728293031323334, float Temp_float_Variable1234567891011121314151617181920212223242526272829303132333435, float Temp_float_Variable123456789101112131415161718192021222324252627282930313233343536, float Temp_float_Variable12345678910111213141516171819202122232425262728293031323334353637, float Temp_float_Variable1234567891011121314151617181920212223242526272829303132333435363738, float Temp_float_Variable123456789101112131415161718192021222324252627282930313233343536373839, ESurvivorAnchorHeightEnum Temp_byte_Variable123, bool CallFunc_Not_PreBool_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FHitResult& CallFunc_K2_AddRelativeRotation_SweepHitResult, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, float CallFunc_VSize_ReturnValue, const struct FRotator& CallFunc_MakeRotationFromAxes_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_BreakVector_X1, float CallFunc_BreakVector_Y1, float CallFunc_BreakVector_Z1, const struct FVector& CallFunc_MakeVector_ReturnValue1, float K2Node_Select_Default, const struct FHitResult& CallFunc_K2_AddLocalOffset_SweepHitResult, float K2Node_Select1_Default, float CallFunc_Subtract_FloatFloat_ReturnValue, float K2Node_Select12_Default, const struct FVector& CallFunc_MakeVector_ReturnValue12, float K2Node_Select123_Default, const struct FVector& CallFunc_MakeVector_ReturnValue123, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct FHitResult& CallFunc_K2_AddLocalOffset_SweepHitResult1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue1, const struct FHitResult& CallFunc_K2_AddLocalOffset_SweepHitResult12);
	void IsActorInsideOfAnchorBounds(class AActor*& Actor, bool* InBounds, bool CallFunc_IsOverlappingActor_ReturnValue);
	float GetTetheredBoxBoundsWidth(float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z);
	float GetTetheredBoxBoundsHeight(float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z);
	float GetTetheredBoxBoundsEQSSpaceBetween();
	float GetTetheredBoxBoundsEQSGridSize();
	struct FVector GetTetheredBoxBoundsCenter();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SurvivorAnchor_C">();
	}
	static class ABP_SurvivorAnchor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SurvivorAnchor_C>();
	}
};

}

