#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectionBookItemPicker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CollectionBookItemPicker.CollectionBookItemPicker_C
// 0x0060 (0x02F8 - 0x0298)
class UCollectionBookItemPicker_C final  : public UFortCollectionBookPicker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(Transient, DuplicateTransient)
	struct FDataTableRowHandle                    BackInputActionName;                               // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FText                                   ConfirmSlotItemTitle;                              // 0x02B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ConfirmSlotItemMessage;                            // 0x02C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDataTableRowHandle                    ConfirmInputActionName;                            // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UCollectionBookRecycleSlotResultsWidget_C* RecycleSlotItemWidget;                             // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CollectionBookItemPicker(int32 EntryPoint, class UFortItem* CallFunc_GetSelectedItem_ReturnValue, const struct FFortDialogExternalLatentActionHandle& Temp_struct_Variable, class FText CallFunc_Get_Type_Text_Type, bool Temp_bool_Variable, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, class FName Temp_name_Variable, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, EFortDialogResult Temp_byte_Variable, class FText CallFunc_Format_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, TDelegate<void(class UObject* Item, bool bIsSelected)> K2Node_CreateDelegate_OutputDelegate, class UFortItem* K2Node_CustomEvent_SelectedItem, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UDONOTUSE_C* CallFunc_Create_ReturnValue, const struct FCommonInputActionData& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, const struct FConfirmationDialogAction& K2Node_MakeStruct_ConfirmationDialogAction, TArray<struct FConfirmationDialogAction>& K2Node_MakeArray_Array1, EFortDialogResult K2Node_CustomEvent_Result, class FName K2Node_CustomEvent_ResultName, bool K2Node_CustomEvent_bWaitingForLatentActionCompletion, const struct FFortDialogExternalLatentActionHandle& K2Node_CustomEvent_WaitingDialogHandle, TDelegate<void(EFortDialogResult Result, class FName ResultName, bool bWaitingForLatentActionCompletion, const struct FFortDialogExternalLatentActionHandle& WaitingDialogHandle)> K2Node_CreateDelegate_OutputDelegate1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue1, TDelegate<void(class UFortItem* SelectedItem)> K2Node_CreateDelegate_OutputDelegate12, class UCollectionBookRecycleSlotResultsWidget_C* CallFunc_Create_ReturnValue1, class UFortAccountItem* CallFunc_GetCurrentSlottedItem_ReturnValue, class UFortAccountItem* CallFunc_GetCurrentSlottedItem_ReturnValue1, bool CallFunc_IsValid_ReturnValue, class UFortItem* CallFunc_GetSelectedItem_ReturnValue1, class UFortAsyncAction_ShowAdvancedLatentConfirmation_NUI* CallFunc_ShowAdvancedLatentActionConfirmation_ReturnValue, class FText CallFunc_Get_Type_Text_Type1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array12, bool CallFunc_IsValid_ReturnValue1, class FText CallFunc_Format_ReturnValue1);
	void ShowSlotItemConfirmation(class UFortItem* SelectedItem);
	void Construct();
	void DialogResult_C897FB8741239C9DAE2430AD3D91A030(EFortDialogResult Result, class FName ResultName, bool bWaitingForLatentActionCompletion, const struct FFortDialogExternalLatentActionHandle& WaitingDialogHandle);
	void HandleItemSelected(class UObject* ItemSelected, bool IsSelected);
	void HandleCommitAction(bool* Passthrough, bool CallFunc_TryCommitSelectedItem_ReturnValue);
	void Get_Type_Text(class UFortItem* Item, class FText* Type, EFortInventoryFilter CallFunc_GetFilterCategory_ReturnValue, EFortItemType CallFunc_GetType_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue1, bool CallFunc_EqualEqual_ByteByte_ReturnValue12, bool CallFunc_EqualEqual_ByteByte_ReturnValue123, bool CallFunc_EqualEqual_ByteByte_ReturnValue1234);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CollectionBookItemPicker_C">();
	}
	static class UCollectionBookItemPicker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectionBookItemPicker_C>();
	}
};

}

