#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EulaTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EulaTab.EulaTab_C
// 0x0040 (0x0250 - 0x0210)
class UEulaTab_C final  : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UWidgetSwitcher*                        EulaSpinnerSwitcher;                               // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlock*                     FortRichTextBlock_0;                               // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_4;                                       // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   FailedToDownloadEulaText;                          // 0x0238(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_EulaTab(int32 EntryPoint, class UFortMcpContext* CallFunc_GetContext_ReturnValue, bool CallFunc_HasEULADownloaded_ReturnValue, bool Temp_bool_Variable, bool K2Node_CustomEvent_bSuccessful, class FText K2Node_CustomEvent_EULAText, class FText K2Node_Select_Default, class UFortMcpContext* CallFunc_GetContext_ReturnValue1, TDelegate<void(bool bSuccessful, class FText EULAText)> K2Node_CreateDelegate_OutputDelegate, class FText CallFunc_GetEULAText_ReturnValue, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue12, bool CallFunc_IsMobileApp_ReturnValue);
	void OnEulaDownloadComplete(bool bSuccessful, class FText EULAText);
	void Activate_Scroll_Box(class UFortUINavigationManager* CallFunc_GetUINavigationManager_ReturnValue);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EulaTab_C">();
	}
	static class UEulaTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEulaTab_C>();
	}
};

}

