#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "BlueprintContext_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SocialTypes_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "EpicCMSUIFramework_classes.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "InputCore_structs.hpp"
#include "Slate_structs.hpp"
#include "Party_structs.hpp"


namespace SDK
{

// Class FortniteUI.FortCollectionBookRewardModalWidget
// 0x0050 (0x0410 - 0x03C0)
class UFortCollectionBookRewardModalWidget final  : public UCommonActivatablePanel
{
public:
	class UCommonTextBlock*                       TitleWidget;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortRewardInfoWidget*                  RewardWidget;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMaterialProgressBar*               ProgressBar;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       ProgressTextWidget;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2064[0x30];                                    // 0x03E0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookRewardModalWidget">();
	}
	static class UFortCollectionBookRewardModalWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookRewardModalWidget>();
	}
};

// Class FortniteUI.AthenaAccountContext
// 0x0000 (0x0028 - 0x0028)
class UAthenaAccountContext final  : public UBlueprintContextBase
{
public:
	void GetBattleBookPurchaseLimit(int32* MaxNumLevelsPossibleToPurchase, int32* BonusLevelsGranted);
	class UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition();
	void SimulateBattleBookPurchase(int32 NumLevelsToPurchase, int32* BonusLevelsGranted, bool* bOverLimit);

	class FText GetCurrentSeasonName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAccountContext">();
	}
	static class UAthenaAccountContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAccountContext>();
	}
};

// Class FortniteUI.AthenaAwardAlertBase
// 0x0008 (0x0210 - 0x0208)
class UAthenaAwardAlertBase final  : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                 PlayerVM;                                          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnAwardGranted(class UFortAwardItemDefinition* AwardDefinition);
	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAwardAlertBase">();
	}
	static class UAthenaAwardAlertBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAwardAlertBase>();
	}
};

// Class FortniteUI.FortGridWidgetBase
// 0x0138 (0x0250 - 0x0118)
class UFortGridWidgetBase : public UContentWidget
{
public:
	TSubclassOf<class UFortGridPickerTile>        ClearWidgetType;                                   // 0x0118(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TileWidth;                                         // 0x0120(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TileHeight;                                        // 0x0124(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TilesAcross;                                       // 0x0128(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TilesDown;                                         // 0x012C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShrinkToFit;                                      // 0x0130(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2066[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PeekOverflowTilePercentage;                        // 0x0134(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                TilePadding;                                       // 0x0138(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            GridBackground;                                    // 0x0148(0x0078)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FMargin                                GridBackgroundPadding;                             // 0x01C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UObject*>                        DataProvider;                                      // 0x01D0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                   OnTileGenerated;                                   // 0x01E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTileClicked;                                     // 0x01F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnMouseEnterTile;                                  // 0x0200(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnMouseLeaveTile;                                  // 0x0210(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortGridPickerTile>        TileWidgetType;                                    // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGridSortKind                                 SortKind;                                          // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReversed;                                         // 0x0229(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2067[0x6];                                     // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Data)>          GetSortKeyFor;                                     // 0x0230(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2068[0x10];                                    // 0x0240(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFortGridPickerTile* GetTileForObject(class UObject* Object);
	TArray<class UFortGridPickerTile*> GetTiles();
	void SetClearWidgetType(TSubclassOf<class UFortGridPickerTile> InClearWidgetType);
	void SetDataProvider(TArray<class UObject*>& Data);
	void SetPeekOverflowTilePercentage(float Percent);
	void SetTileHeight(float Height);
	void SetTilePadding(const struct FMargin& Padding);
	void SetTilesAcross(int32 Across);
	void SetTilesDown(int32 Down);
	void SetTileWidth(float Width);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGridWidgetBase">();
	}
	static class UFortGridWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGridWidgetBase>();
	}
};

// Class FortniteUI.FortGridPickerButton
// 0x0048 (0x0298 - 0x0250)
class UFortGridPickerButton final  : public UFortGridWidgetBase
{
public:
	EMenuPlacement                                GridPlacement;                                     // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2069[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGridPickerGrid*                    GridWidget;                                        // 0x0258(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCloseOnTileClicked;                               // 0x0260(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_206A[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             GridWidgetDelegate;                                // 0x0268(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnGridPickerOpenChanged;                           // 0x0278(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_206B[0x10];                                    // 0x0288(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFortGridPickerGrid* CreateGridWidget__DelegateSignature();
	void OnButtonClicked();
	void OnIsGridPickerOpenChanged__DelegateSignature(bool IsOpen);
	void SetIsOpen(bool ShouldBeOpen);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGridPickerButton">();
	}
	static class UFortGridPickerButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGridPickerButton>();
	}
};

// Class FortniteUI.FortActivatablePanel
// 0x0028 (0x03E8 - 0x03C0)
#pragma pack(push, 0x1)
class alignas(0x08) UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	bool                                          bIsPushedOnToContentPanelStack;                    // 0x03C0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlreadyOnContentPanelStack;                     // 0x03C1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputPriority                                InputPriority;                                     // 0x03C2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_206C[0x25];                                    // 0x03C3(0x0025)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void RestoreScrollWidget(class UWidget* FallbackWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivatablePanel">();
	}
	static class UFortActivatablePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatablePanel>();
	}
};
#pragma pack(pop)

// Class FortniteUI.AthenaChallengeBundleScheduleScreenBase
// 0x0018 (0x0400 - 0x03E8)
class UAthenaChallengeBundleScheduleScreenBase : public UFortActivatablePanel
{
public:
	UMulticastDelegateProperty_                   OnChallengesChanged;                               // 0x03E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_206D[0x8];                                     // 0x03F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetChallengeBundleItems(class UFortChallengeBundleScheduleItem* Bundle, TArray<class UFortChallengeBundleItem*>* OutActiveItems, TArray<class UFortChallengeBundleItemDefinition*>* OutUnlockableItems);
	void GetChallengeBundleSchedules(TArray<class UFortChallengeBundleScheduleItem*>* OutActiveBundles, TArray<class UFortChallengeBundleScheduleDefinition*>* OutUnlockableBundles);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaChallengeBundleScheduleScreenBase">();
	}
	static class UAthenaChallengeBundleScheduleScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaChallengeBundleScheduleScreenBase>();
	}
};

// Class FortniteUI.FortSquadStatDetailsWidget
// 0x0030 (0x0240 - 0x0210)
class UFortSquadStatDetailsWidget : public UCommonUserWidget
{
public:
	uint8                                         Pad_206E[0x30];                                    // 0x0210(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSquadStatDetailsWidget">();
	}
	static class UFortSquadStatDetailsWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSquadStatDetailsWidget>();
	}
};

// Class FortniteUI.FortHUDElementWidget
// 0x0028 (0x0238 - 0x0210)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	struct FGameplayTagContainer                  HUDElementTag;                                     // 0x0210(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_206F[0x8];                                     // 0x0230(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnHUDElementVisibilityChanged(struct FGameplayTagContainer& HiddenHUDElementTags);
	void HandleOnHUDResetToDefaults();
	void OnVisibilitySetEvent(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHUDElementWidget">();
	}
	static class UFortHUDElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHUDElementWidget>();
	}
};

// Class FortniteUI.AthenaCompassBase
// 0x0110 (0x0348 - 0x0238)
class UAthenaCompassBase : public UFortHUDElementWidget
{
public:
	class UMaterialInstanceDynamic*               CompassMaterial;                                   // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FSlateBrush>                    MarkerBrushes;                                     // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            HeadingIndicatorBrush;                             // 0x0250(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         MarkerVerticalOffset;                              // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2070[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPlayerViewModel*                 VM;                                                // 0x02D0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateFontInfo                         HeadingFont;                                       // 0x02D8(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2071[0x18];                                    // 0x0330(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindToModel(class UAthenaPlayerViewModel* ViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCompassBase">();
	}
	static class UAthenaCompassBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCompassBase>();
	}
};

// Class FortniteUI.FortItemInspectCycleWidget
// 0x0040 (0x0250 - 0x0210)
class UFortItemInspectCycleWidget : public UCommonUserWidget
{
public:
	uint8                                         Pad_2072[0x8];                                     // 0x0210(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnItemToRepresentChanged;                          // 0x0218(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UFortItemTileView>       ItemTileView;                                      // 0x0228(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItem>               ItemToRepresent;                                   // 0x0230(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ControllerThresholdForSelection;                   // 0x0238(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimeBetweenControllerSelections;                   // 0x023C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2073[0x10];                                    // 0x0240(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnItemCycled(class UFortItem* OldItem, class UFortItem* NewItem, int32 OffsetFromPreviousItem);
	void SelectItemWithOffset(int32 Offset);
	void SelectNextItem();
	void SelectPreviousItem();
	void SetInputEnabled(bool Enabled);
	void SetItemToRepresent(class UFortItem* NewItemToRepresent);

	class UFortItem* GetItemWithOffset_BP(int32 IndexOffset) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemInspectCycleWidget">();
	}
	static class UFortItemInspectCycleWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemInspectCycleWidget>();
	}
};

// Class FortniteUI.FortItemPickerBase
// 0x0068 (0x0278 - 0x0210)
class UFortItemPickerBase : public UCommonUserWidget
{
public:
	UMulticastDelegateProperty_                   OnSelectionChangedEvent;                           // 0x0210(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSelectionCommittedEvent;                         // 0x0220(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnItemHoveredEvent;                                // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnItemUnhovered;                                   // 0x0240(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortItemTileView*                      PickerTileView;                                    // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bConfirmSelectionIfAlreadySelectedAfterOneClick;   // 0x0258(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2076[0x7];                                     // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                NewlySelectedItem;                                 // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                                   // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	bool CanItemBeComitted(class UFortItem* ItemToCommit);
	void CenterSelectedItemTileWidget();
	void ClearSelection();
	void HandlePickerItemClicked(class UObject* ObjectOfClickedTile);
	void HandlePickerItemDoubleClicked(class UObject* ObjectOfClickedTile);
	void HandlePickerItemHovered(class UObject* ObjectOfHoveredTile);
	void HandlePickerItemSelected(class UObject* ObjectWhoseSelectionChanged, bool bIsSelected);
	void HandlePickerTileCreated(class UUserWidget* Widget);
	void HandlePickerTileDestroyed(class UUserWidget* Widget);
	void OnItemSelectionEvent__DelegateSignature(class UFortItem* SelectedItem);
	bool SetSelectedIndex(int32 Param_Index);
	void SetSelectedItem(class UFortItem* ItemToSelect);
	bool TryCommitSelectedItem();

	int32 GetIndexForItem(class UObject* Item) const;
	class UFortItem* GetSelectedItem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemPickerBase">();
	}
	static class UFortItemPickerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemPickerBase>();
	}
};

// Class FortniteUI.AthenaCustomizationPicker
// 0x0050 (0x02C8 - 0x0278)
class UAthenaCustomizationPicker : public UFortItemPickerBase
{
public:
	UMulticastDelegateProperty_                   OnCosmeticSelectionSaving;                         // 0x0278(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnCosmeticSelectionSaved;                          // 0x0288(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_207B[0x10];                                    // 0x0298(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EAthenaCustomizationCategory                  CustomizeCategory;                                 // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_207C[0x3];                                     // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubslotIndex;                                      // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCommitingSelection;                               // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_207D[0x17];                                    // 0x02B1(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginCustomizationCategory(EAthenaCustomizationCategory Category, int32 SubslotToEdit);
	void EndCustomizationCategory();
	void OnCosmeticChangeSaveEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCustomizationPicker">();
	}
	static class UAthenaCustomizationPicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationPicker>();
	}
};

// Class FortniteUI.FortCollectionBookWidget
// 0x0038 (0x0420 - 0x03E8)
class UFortCollectionBookWidget : public UFortActivatablePanel
{
public:
	class UFortCollectionBookProgressWidget*      ProgressWidget;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonWidgetSwitcher*                  MainWidgetSwitcher;                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCollectionBookPrimaryPanel*        PrimaryPanelWidget;                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCollectionBookSectionPanel*        SectionPanelWidget;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PrimaryPanelIdx;                                   // 0x0408(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SectionPanelIdx;                                   // 0x040C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_207F[0x10];                                    // 0x0410(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCollectionBookPageClicked(class UFortCollectionBookPage* ClickedPage);
	void OnCollectionBookPageSelected(class UFortCollectionBookPage* SelectedPage);
	void OnCollectionBookSectionClicked(class UFortCollectionBookSection* ClickedSection);
	void OnCollectionBookSectionCloseRequest();
	void OnPreviewXPChangeRequest(int32 XPChange);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookWidget">();
	}
	static class UFortCollectionBookWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookWidget>();
	}
};

// Class FortniteUI.FortItemTileButton
// 0x0030 (0x07B0 - 0x0780)
class UFortItemTileButton : public UCommonButton
{
public:
	uint8                                         Pad_2080[0x8];                                     // 0x0780(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMultiSizeItemCard*                 ItemWidget;                                        // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItem>               Item;                                              // 0x0790(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortItemCardSize                             ItemCardSize;                                      // 0x0798(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsRewardCard;                                      // 0x0799(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2081[0x6];                                     // 0x079A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                                   // 0x07A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemTileButton">();
	}
	static class UFortItemTileButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemTileButton>();
	}
};

// Class FortniteUI.FortItemPickerButton
// 0x0000 (0x07B0 - 0x07B0)
class UFortItemPickerButton : public UFortItemTileButton
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemPickerButton">();
	}
	static class UFortItemPickerButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemPickerButton>();
	}
};

// Class FortniteUI.FortCollectionBookRecycleSlotResultsWidget
// 0x0018 (0x0228 - 0x0210)
class UFortCollectionBookRecycleSlotResultsWidget : public UCommonUserWidget
{
public:
	class UPanelWidget*                           RecycleResultsWidget;                              // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortItemCardSize                             ItemCardSize;                                      // 0x0218(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2082[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItem*                       ItemToRecycle;                                     // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetCurrentItemToRecycle(class UFortAccountItem* InItemToRecycle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookRecycleSlotResultsWidget">();
	}
	static class UFortCollectionBookRecycleSlotResultsWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookRecycleSlotResultsWidget>();
	}
};

// Class FortniteUI.AthenaCustomizationPickerTileButton
// 0x0008 (0x07B8 - 0x07B0)
class UAthenaCustomizationPickerTileButton : public UFortItemPickerButton
{
public:
	uint8                                         Pad_2083[0x8];                                     // 0x07B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCustomizationPickerTileButton">();
	}
	static class UAthenaCustomizationPickerTileButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationPickerTileButton>();
	}
};

// Class FortniteUI.AthenaCustomizationScreenBase
// 0x0008 (0x03F0 - 0x03E8)
class UAthenaCustomizationScreenBase : public UFortActivatablePanel
{
public:
	class UAthenaCustomizationPicker*             SelectionPicker;                                   // 0x03E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UFortItem* GetFavoriteItemForCategory(EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCustomizationScreenBase">();
	}
	static class UAthenaCustomizationScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationScreenBase>();
	}
};

// Class FortniteUI.FortCollectionBookSlotButton
// 0x0008 (0x0788 - 0x0780)
class UFortCollectionBookSlotButton final  : public UCommonButton
{
public:
	class UFortCollectionBookSlotWidget*          CollectionBookSlotWidget;                          // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnSlottedItemUpdated();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookSlotButton">();
	}
	static class UFortCollectionBookSlotButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookSlotButton>();
	}
};

// Class FortniteUI.AthenaCustomizationSlotSelectorButton
// 0x0018 (0x0798 - 0x0780)
class UAthenaCustomizationSlotSelectorButton : public UCommonButton
{
public:
	EAthenaCustomizationCategory                  CustomizationType;                                 // 0x0780(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2085[0x3];                                     // 0x0781(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubslotIndex;                                      // 0x0784(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMultiSizeItemCard*                 ItemWidget;                                        // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2086[0x8];                                     // 0x0790(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCustomizationType(EAthenaCustomizationCategory NewType, int32 InSubslotIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCustomizationSlotSelectorButton">();
	}
	static class UAthenaCustomizationSlotSelectorButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationSlotSelectorButton>();
	}
};

// Class FortniteUI.AthenaEquippedItemBase
// 0x0018 (0x0250 - 0x0238)
class UAthenaEquippedItemBase : public UFortHUDElementWidget
{
public:
	EEquippedWeaponDisplay                        CurrentMode;                                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2088[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPlayerViewModel*                 VM;                                                // 0x0240(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2089[0x8];                                     // 0x0248(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AmmoChanged(int32 MagazineAmmoCount, int32 BackupAmmoCount, int32 TotalRemaining);
	void AmmoTypeChanged(class AFortWeaponRanged* RangedWeapon, class UFortWorldItemDefinition* Item);
	void HasAmmoChanged(bool bHasAmmo);
	void OnBuildingMaterialChanged();
	void OnLocalAmmoChanged(int32 LocalCount, int32 LocalRemaining);
	void OnPawnChanged();
	void OnWeaponChanged(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnWorldItemsChanged();
	void ResourceCountChanged(int32 ResourceCount);
	void ResourceTypeChanged(class UFortResourceItemDefinition* Item, int32 ResourceCount);
	void SetViewModel(class UAthenaPlayerViewModel* ViewModel);
	void UtilityItemCountChanged(int32 Remaining);
	void UtilityItemTypeChanged(class AFortWeapon* Weapon, class UFortWeaponItemDefinition* Item);
	void WeaponTypeChanged(EEquippedWeaponDisplay Mode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaEquippedItemBase">();
	}
	static class UAthenaEquippedItemBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEquippedItemBase>();
	}
};

// Class FortniteUI.FortExpeditionPickVehicleWidget
// 0x0010 (0x03D0 - 0x03C0)
class UFortExpeditionPickVehicleWidget : public UCommonActivatablePanel
{
public:
	TWeakObjectPtr<class UFortExpeditionItem>     Item;                                              // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_208B[0x8];                                     // 0x03C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetData(class UFortExpeditionItem* InItem);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortExpeditionPickVehicleWidget">();
	}
	static class UFortExpeditionPickVehicleWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortExpeditionPickVehicleWidget>();
	}
};

// Class FortniteUI.AthenaEventGamesBase
// 0x0008 (0x03F0 - 0x03E8)
class UAthenaEventGamesBase final  : public UFortActivatablePanel
{
public:
	uint8                                         Pad_208C[0x8];                                     // 0x03E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaEventGamesBase">();
	}
	static class UAthenaEventGamesBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEventGamesBase>();
	}
};

// Class FortniteUI.FortRewardNotificationData
// 0x0008 (0x0030 - 0x0028)
class UFortRewardNotificationData : public UObject
{
public:
	EFrontEndRewardType                           RewardType;                                        // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_208D[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetIconBrush(struct FSlateBrush* IconBrush, EFortBrushSize BrushSize);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortRewardNotificationData">();
	}
	static class UFortRewardNotificationData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRewardNotificationData>();
	}
};

// Class FortniteUI.FortRewardQuestData
// 0x0008 (0x0038 - 0x0030)
class UFortRewardQuestData final  : public UFortRewardNotificationData
{
public:
	class UFortQuestItem*                         Quest;                                             // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	bool GetIconBrush(struct FSlateBrush* IconBrush, EFortBrushSize BrushSize);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortRewardQuestData">();
	}
	static class UFortRewardQuestData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRewardQuestData>();
	}
};

// Class FortniteUI.AthenaGamePhaseWidgetBase
// 0x0010 (0x0248 - 0x0238)
class UAthenaGamePhaseWidgetBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                             TimeText;                                          // 0x0238(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2090[0x8];                                     // 0x0240(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleGamePhaseStepChanged(EAthenaGamePhaseStep GamePhaseStep);
	void OnGamePhaseStepChanged(EAthenaGamePhaseStep GamePhaseStep);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGamePhaseWidgetBase">();
	}
	static class UAthenaGamePhaseWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGamePhaseWidgetBase>();
	}
};

// Class FortniteUI.FortUIStateWidget_NUI
// 0x0018 (0x03D8 - 0x03C0)
#pragma pack(push, 0x1)
class alignas(0x08) UFortUIStateWidget_NUI : public UCommonActivatablePanel
{
public:
	uint8                                         Pad_2091[0x8];                                     // 0x03C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContentPushState>              StackStates;                                       // 0x03C8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void OnEnterState(EFortUIState PreviousUIState);
	void OnExitState(EFortUIState NextUIState);
	void OnFrontEndVisibilityUpdated(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void PopAllContentWidgets();
	class UWidget* PopContentWidget();
	class UWidget* PopContentWidgetInternal(const struct FContentPushState& State);
	void PushContentWidget(class UWidget* Widget);
	void PushContentWidgetAdvanced(class UWidget* Widget, bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void PushContentWidgetInternal(class UWidget* Widget, const struct FContentPushState& State);
	void RequestOpenSocialMenu();
	void SetFrontEndVisibility(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateWidget_NUI">();
	}
	static class UFortUIStateWidget_NUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateWidget_NUI>();
	}
};
#pragma pack(pop)

// Class FortniteUI.FortSquadSlotSelectorPopupMenu
// 0x0000 (0x03D0 - 0x03D0)
class UFortSquadSlotSelectorPopupMenu : public UCommonPopupMenu
{
public:
	class UFortSquadSlotSelectorButton* GetHostButton() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSquadSlotSelectorPopupMenu">();
	}
	static class UFortSquadSlotSelectorPopupMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSquadSlotSelectorPopupMenu>();
	}
};

// Class FortniteUI.AthenaHUDBase
// 0x0008 (0x03E0 - 0x03D8)
class UAthenaHUDBase : public UFortUIStateWidget_NUI
{
public:
	class UAthenaPlayerViewModel*                 PlayerViewModel;                                   // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnHUDScaleChanged(float HUDScale);
	void ViewModelChanged(class UAthenaPlayerViewModel* ViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaHUDBase">();
	}
	static class UAthenaHUDBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDBase>();
	}
};

// Class FortniteUI.AthenaHUDContext
// 0x0138 (0x0160 - 0x0028)
class UAthenaHUDContext final  : public UBlueprintContextBase
{
public:
	uint8                                         Pad_2095[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnLocalPlayerWon;                                  // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnLocalTeamWon;                                    // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnLocalPlayerKilledPlayer;                         // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnLocalPlayerDBNOStateChanged;                     // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnUIGameplayCue;                                   // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnViewTargetHealthChanged;                         // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnViewTargetShieldChanged;                         // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnViewTargetDBNOChanged;                           // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnLocalPlayerBeginSkydiving;                       // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSquadMembersChanged;                             // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSquadMemberKillsChanged;                         // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnAthenaAutoFireChanged;                           // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnClientSettingsShowViewersChanged;                // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnAthenaGamePhaseChanged;                          // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnInventoryItemSelected;                           // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnInventorySwapStarted;                            // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnInventorySwapComplete;                           // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UWidget*                                MoveButtonWidget;                                  // 0x0140(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bMoveButtonMode;                                   // 0x0148(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPendingAttachToHUD;                               // 0x0149(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2096[0x2];                                     // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UFortItem>               LastSelectedInventoryItem;                         // 0x014C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2097[0xC];                                     // 0x0154(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginUseFromHUD();
	void CancelSwap();
	void EnableAutoRunFromHUD(bool bEnable);
	void EndUseFromHUD();
	void ExecuteActionNameFromHUD(class FName ActionName);
	void FireFromHUDStart();
	void FireFromHUDStop();
	void HandleGamePhaseChange(EAthenaGamePhaseStep NewGamePhase);
	void HandleLocalPlayerBeginSkydiving();
	void HandleLocalPlayerDBNOStateChanged(bool bIsDBNO);
	void HandleUIGameplayCue(class FName CueName, EGameplayCueEvent EventType, struct FGameplayCueParameters& Parameters);
	void OnClientSettingUpdatedShowViewers();
	void SelectWidgetToMove(class UWidget* Widget);
	bool SetAutoFireFromReticleMode(bool bAutoFireOn);
	void SetLockOnStickCoords(struct FVector2D& LockOnCoords);
	void SetSelectedInventoryItem(class UFortItem* Item);
	void SetSelectWidgetToMoveMode(bool bSet);
	void SetTargetingToggleable(bool bNewValue);
	void StartOrFinishSwap(int32 SlotIndex);
	void StopTargettingFromHUD();
	void TakeItemSelectionInputFromHUD(int32 SlotIdx, bool bReloadOrUseIfAlreadySelected);
	void TakeLookInputFromHUD(const struct FRotator& LookRotator);
	void TakeMovementInputFromHUD(const struct FVector& MoveVector, bool bTrySprint);
	void UpdateSelectedWidgetMoveOffsetVector(struct FVector2D& VectorOffset, float FMoveScale);
	void UseOrRleoadFromHUDStart();
	void UseOrRleoadFromHUDStop();

	bool CanCurrentWeaponAutoFireFromReticle() const;
	float GetBatteryLevel() const;
	void GetLocalTime(int32* Hours, int32* Minutes) const;
	class UFortItem* GetSelectedInventoryItem() const;
	float GetTouchAimSensitivity() const;
	float GetTouchBaseSensitivity() const;
	float GetTouchScopeSensitivity() const;
	bool HasLockOnTarget() const;
	bool HasWifi() const;
	bool IsAutoFireFromReticleModeEnabled() const;
	bool IsCrouching() const;
	bool IsCurrentWeaponFiring() const;
	bool IsInBuildMode() const;
	bool IsInSelectWidgetToMoveMode() const;
	bool IsMovingSelectedWidget() const;
	bool IsShowViewerCountEnabled() const;
	bool IsSwapping() const;
	bool IsTargeting() const;
	bool IsUsingAutoFire() const;
	bool IsUsingScope() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaHUDContext">();
	}
	static class UAthenaHUDContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDContext>();
	}
};

// Class FortniteUI.AthenaHUDGamePhaseChangingBase
// 0x0008 (0x0240 - 0x0238)
class UAthenaHUDGamePhaseChangingBase : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_209B[0x8];                                     // 0x0238(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GamePhaseStepChanged(EAthenaGamePhaseStep Step);
	void HandleGamePhaseStepChanged(EAthenaGamePhaseStep Step);
	void UpdateMessaging(EAthenaGamePhaseStep Step, class FText& MESSAGE, class FText& TimeText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaHUDGamePhaseChangingBase">();
	}
	static class UAthenaHUDGamePhaseChangingBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDGamePhaseChangingBase>();
	}
};

// Class FortniteUI.FortCraftingBarWidget
// 0x0028 (0x0260 - 0x0238)
class UFortCraftingBarWidget : public UFortHUDElementWidget
{
public:
	class UCommonTextBlock*                       CraftingText;                                      // 0x0238(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UProgressBar*                           CraftingProgressBar;                               // 0x0240(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CompletedRemainVisibleTime;                        // 0x0248(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_209D[0x14];                                    // 0x024C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePlayerStartedCrafting();
	void HandlePlayerStoppedCrafting(bool bSuccess, EFortCraftFailCause CraftFailureCause);
	void OnCompletedSetHidden();
	void SetHideCraftingBar(bool bInHideCraftBar);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCraftingBarWidget">();
	}
	static class UFortCraftingBarWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCraftingBarWidget>();
	}
};

// Class FortniteUI.AthenaHUDInputWidget
// 0x0000 (0x0210 - 0x0210)
class UAthenaHUDInputWidget final  : public UCommonUserWidget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaHUDInputWidget">();
	}
	static class UAthenaHUDInputWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDInputWidget>();
	}
};

// Class FortniteUI.AthenaHUDPlayerActionAlertBase
// 0x0020 (0x0258 - 0x0238)
class UAthenaHUDPlayerActionAlertBase : public UFortHUDElementWidget
{
public:
	class AFortPlayerPawnAthena*                  LastPlayerPawn;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bReadyForNextAlert;                                // 0x0240(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_209E[0x17];                                    // 0x0241(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AlertPlayer(EAthenaPlayerActionAlert Alert, class FText& DetailText);
	void RequestNextAlert();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaHUDPlayerActionAlertBase">();
	}
	static class UAthenaHUDPlayerActionAlertBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDPlayerActionAlertBase>();
	}
};

// Class FortniteUI.FortGameFeedbackBase
// 0x0098 (0x0480 - 0x03E8)
class UFortGameFeedbackBase : public UFortActivatablePanel
{
public:
	class UEditableText*                          SubjectEditable;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMultiLineEditableText*                 BodyEditable;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonGroup*                     ButtonGroup;                                       // 0x03F8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_20A0[0x80];                                    // 0x0400(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddButtonWithFeedbackType(class UCommonButton* Button, EFortUIGameFeedbackType GameFeedbackType);
	void CancelFeedback();
	void InitiateDebugInfoForFeedback();
	void OnInitiateDebugInfoForFeedbackComplete();
	void OnSelectionButtonChanged(class UCommonButton* SelectedButton, int32 ButtonIndex);
	void SubmitFeedback();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameFeedbackBase">();
	}
	static class UFortGameFeedbackBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameFeedbackBase>();
	}
};

// Class FortniteUI.AthenaHUDTeamIndicatorBase
// 0x0010 (0x0110 - 0x0100)
class UAthenaHUDTeamIndicatorBase final  : public UWidget
{
public:
	uint8                                         Pad_20A3[0x10];                                    // 0x0100(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaHUDTeamIndicatorBase">();
	}
	static class UAthenaHUDTeamIndicatorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDTeamIndicatorBase>();
	}
};

// Class FortniteUI.FortSkillTreePageSelectorButton
// 0x0018 (0x0798 - 0x0780)
class UFortSkillTreePageSelectorButton final  : public UCommonButton
{
public:
	class FName                                   SkillTreePageId;                                   // 0x0780(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortSkillTreeViewer>       SkillTreeViewerType;                               // 0x0788(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20A4[0x8];                                     // 0x0790(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FText GetButtonNodeCompletionText();
	void HandleDifferentSkillTreePageSet();
	void HandleRefreshSkillTreeNodePage();
	bool IsSkillTreePageLocked();

	bool TryGetSkillTreeNodeState(class FName NodeID, struct FHomebaseNodeState* OutNodeState) const;
	bool TryGetStaticSkillTreePageData(struct FHomebaseNodePage* OutStaticData) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSkillTreePageSelectorButton">();
	}
	static class UFortSkillTreePageSelectorButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSkillTreePageSelectorButton>();
	}
};

// Class FortniteUI.AthenaIndicatorLayerBase
// 0x0008 (0x0210 - 0x0208)
