#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SurvivorAvoidEnemy

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_SurvivorAvoidEnemy.GAB_SurvivorAvoidEnemy_C
// 0x0098 (0x0B48 - 0x0AB0)
class UGAB_SurvivorAvoidEnemy_C final  : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB0(0x0008)(Transient, DuplicateTransient)
	bool                                          Debug;                                             // 0x0AB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AbilityEnding;                                     // 0x0AB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AE6[0x6];                                     // 0x0ABA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQuery*                              EQS_AvoidEnemy;                                    // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivor_C*                            SurvivorPawn;                                      // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMovementUrgency                          MovementUrgencyWhenAvoiding;                       // 0x0AD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMovementUrgency                          InitialMovementUrgency;                            // 0x0AD1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AE7[0x2];                                     // 0x0AD2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AvoidLocation;                                     // 0x0AD4(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        EQSResults;                                        // 0x0AE0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FFortFeedbackHandle                    FeedbackEvent_Help;                                // 0x0AF0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         HelpAnimationCooldown;                             // 0x0B08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HelpAnimationMinRange;                             // 0x0B0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HelpAnimationLastTimePlayed;                       // 0x0B10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SurvivorIsArmed;                                   // 0x0B14(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSurvivorInsideOfAnchorBounds;                    // 0x0B15(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AE8[0x2];                                     // 0x0B16(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name_HelpMeAttacked;                               // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverwhelmedSpeechDelay;                            // 0x0B20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldTriggerOverwhelmedSpeech;                   // 0x0B24(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AE9[0x3];                                     // 0x0B25(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_MoveAI*                AvoidMove;                                         // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateFocalPointHandle;                            // 0x0B30(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class AActor*                                 CurrentFocusTarget;                                // 0x0B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LostFocusStartTime;                                // 0x0B40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GAB_SurvivorAvoidEnemy(int32 EntryPoint, EEnvQueryStatus Temp_byte_Variable, bool Temp_bool_Variable, TDelegate<void(EPathFollowingResult Result, class AAIController* AIController)> K2Node_CreateDelegate_OutputDelegate, EPathFollowingResult K2Node_CustomEvent_Result, class AAIController* K2Node_CustomEvent_AIController, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate12, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate123, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate1234, struct FGameplayAbilityTargetDataHandle& K2Node_CustomEvent_TargetData12, const struct FGameplayTag& K2Node_CustomEvent_ApplicationTag12, TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate12345, struct FGameplayAbilityTargetDataHandle& K2Node_CustomEvent_TargetData1, const struct FGameplayTag& K2Node_CustomEvent_ApplicationTag1, TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate123456, struct FGameplayAbilityTargetDataHandle& K2Node_CustomEvent_TargetData, const struct FGameplayTag& K2Node_CustomEvent_ApplicationTag, TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate1234567, const struct FGameplayTag& Temp_struct_Variable, const struct FGameplayAbilityTargetDataHandle& Temp_struct_Variable1, bool Temp_bool_Variable1, class UClass* Temp_class_Variable, class UClass* Temp_class_Variable1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate12345678, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate123456789, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, TDelegate<void(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus)> K2Node_CreateDelegate_OutputDelegate12345678910, bool Temp_bool_Variable12, bool CallFunc_IsActorInsideOfAnchorBounds_InBounds, bool CallFunc_IsValid_ReturnValue, bool CallFunc_K2_CommitAbility_ReturnValue, bool CallFunc_K2_CommitAbility_ReturnValue1, bool Temp_bool_Variable123, class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue, bool CallFunc_IsValid_ReturnValue1, class AActor* CallFunc_GetAIAbilityTarget_ReturnValue, class AFortPawn* CallFunc_GetActivatingPawn_ReturnValue, float CallFunc_GetGameTimeInSeconds_ReturnValue, float CallFunc_GetDistanceTo_ReturnValue, float CallFunc_GetGameTimeInSeconds_ReturnValue1, bool CallFunc_Greater_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue, bool CallFunc_EqualEqual_FloatFloat_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, class AActor* CallFunc_GetAIAbilityTarget_ReturnValue1, bool CallFunc_BooleanAND_ReturnValue, class AFortPawn* CallFunc_GetActivatingPawn_ReturnValue1, class UClass* K2Node_Select_Default, class UFortAbilityTask_MoveAI* CallFunc_CreateMoveAITask_ReturnValue, class AActor* CallFunc_GetAIAbilityTarget_ReturnValue12, bool CallFunc_IsValid_ReturnValue12, bool CallFunc_BooleanAND_ReturnValue1, bool CallFunc_IsValid_ReturnValue123, class AActor* CallFunc_GetAIAbilityTarget_ReturnValue123, bool Temp_bool_Variable1234, bool CallFunc_IsValid_ReturnValue1234, class AFortPawn* CallFunc_GetActivatingPawn_ReturnValue12, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue1, bool Temp_bool_Variable12345, bool CallFunc_IsValid_ReturnValue12345, class UEnvQueryInstanceBlueprintWrapper* K2Node_CustomEvent_QueryInstance, EEnvQueryStatus K2Node_CustomEvent_QueryStatus, TArray<struct FVector>& CallFunc_GetResultsAsLocations_ReturnValue, bool K2Node_Event_bWasCancelled, const struct FVector& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool Temp_bool_Variable123456, int32 CallFunc_GetRemainingAmmo_ReturnValue, int32 CallFunc_GetMagazineAmmoCount_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface, bool K2Node_DynamicCast_bSuccess, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_HasMatchingGameplayTag_ReturnValue, bool CallFunc_BooleanAND_ReturnValue12, bool Temp_bool_Variable1234567, bool K2Node_Select1_Default, bool CallFunc_BooleanAND_ReturnValue123, class UEnvQueryInstanceBlueprintWrapper* CallFunc_RunEQSQuery_ReturnValue, int32 CallFunc_Array_Length_ReturnValue1, class AFortPawn* CallFunc_GetActivatingPawn_ReturnValue123, class ASurvivor_C* K2Node_DynamicCast_AsSurvivor, bool K2Node_DynamicCast_bSuccess1, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue1);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnQueryFinished(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus);
	void UpdateFocalPoint();
	void TriggerOverwhelmedSpeech();
	void TriggerHelpSpeech();
	void StartAvoidMove();
	void K2_ActivateAbility();
	void Triggered_F461FD4E44811E3F3E4AFD81EB1A0127(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_F461FD4E44811E3F3E4AFD81EB1A0127(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_F461FD4E44811E3F3E4AFD81EB1A0127(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void OnComplete_6FCA0F06404AB0DEE9586D8157793BFD();
	void OnInterrupted_6FCA0F06404AB0DEE9586D8157793BFD();
	void OnCancelled_6FCA0F06404AB0DEE9586D8157793BFD();
	void OnRequestFailed_6FCA0F06404AB0DEE9586D8157793BFD();
	void OnMoveFinished_6FCA0F06404AB0DEE9586D8157793BFD(EPathFollowingResult Result, class AAIController* AIController);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_SurvivorAvoidEnemy_C">();
	}
	static class UGAB_SurvivorAvoidEnemy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_SurvivorAvoidEnemy_C>();
	}
};

}

