#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SurvivorWander

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_SurvivorWander.GAB_SurvivorWander_C
// 0x0058 (0x0B08 - 0x0AB0)
class UGAB_SurvivorWander_C final  : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB0(0x0008)(Transient, DuplicateTransient)
	bool                                          Debug;                                             // 0x0AB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AbilityEnding;                                     // 0x0AB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC9[0x6];                                     // 0x0ABA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQuery*                              EQS_AnchorWander;                                  // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivor_C*                            SurvivorPawn;                                      // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WanderLocation;                                    // 0x0AD0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaitTimeAfterWanderMin;                            // 0x0ADC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaitTimeAfterWanderMax;                            // 0x0AE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ACA[0x4];                                     // 0x0AE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        EQSResults;                                        // 0x0AE8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          SetFocalPointToAbilityTargetWhileMoving;           // 0x0AF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSurvivorInsideOfAnchorBounds;                    // 0x0AF9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ACB[0x6];                                     // 0x0AFA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_MoveAI*                WanderMove;                                        // 0x0B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GAB_SurvivorWander(int32 EntryPoint, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate12, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate123, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate1234, bool Temp_bool_Variable, class UClass* Temp_class_Variable, class UClass* Temp_class_Variable1, EEnvQueryStatus Temp_byte_Variable, bool Temp_bool_Variable1, bool Temp_bool_Variable12, bool Temp_bool_Variable123, bool Temp_bool_Variable1234, bool Temp_bool_Variable12345, bool Temp_bool_Variable123456, TDelegate<void(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus)> K2Node_CreateDelegate_OutputDelegate12345, bool CallFunc_K2_CommitAbility_ReturnValue, bool CallFunc_IsActorInsideOfAnchorBounds_InBounds, bool CallFunc_K2_CommitAbility_ReturnValue1, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_K2_CommitAbility_ReturnValue12, float CallFunc_RandomFloatInRange_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue1, class UAbilityTask_WaitDelay* CallFunc_WaitDelay_ReturnValue, bool CallFunc_IsValid_ReturnValue, class AActor* CallFunc_GetAIAbilityTarget_ReturnValue, EPathFollowingResult K2Node_CustomEvent_Result, class AAIController* K2Node_CustomEvent_AIController, class AFortAIDirector* CallFunc_GetAIDirector_ReturnValue, bool CallFunc_IsAnyActiveEncounterRelevantToDefender_ReturnValue, class UClass* K2Node_Select_Default, bool CallFunc_Not_PreBool_ReturnValue12, class UFortAbilityTask_MoveAI* CallFunc_CreateMoveAITask_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_IsValid_ReturnValue1, TDelegate<void(EPathFollowingResult Result, class AAIController* AIController)> K2Node_CreateDelegate_OutputDelegate123456, class AFortAIDirector* CallFunc_GetAIDirector_ReturnValue1, bool CallFunc_IsAnyActiveEncounterRelevantToDefender_ReturnValue1, bool CallFunc_Not_PreBool_ReturnValue123, bool CallFunc_IsValid_ReturnValue12, bool CallFunc_BooleanAND_ReturnValue1, class UEnvQueryInstanceBlueprintWrapper* K2Node_CustomEvent_QueryInstance, EEnvQueryStatus K2Node_CustomEvent_QueryStatus, bool K2Node_Event_bWasCancelled, TArray<struct FVector>& CallFunc_GetResultsAsLocations_ReturnValue, bool K2Node_Select1_Default, const struct FVector& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue12, class UEnvQueryInstanceBlueprintWrapper* CallFunc_RunEQSQuery_ReturnValue, class AFortPawn* CallFunc_GetActivatingPawn_ReturnValue, class ASurvivor_C* K2Node_DynamicCast_AsSurvivor, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Length_ReturnValue1, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnQueryFinished(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus);
	void OnComplete_823C4D1641576DFB48835EA7477D7A9D();
	void OnInterrupted_823C4D1641576DFB48835EA7477D7A9D();
	void OnCancelled_823C4D1641576DFB48835EA7477D7A9D();
	void OnRequestFailed_823C4D1641576DFB48835EA7477D7A9D();
	void OnMoveFinished_823C4D1641576DFB48835EA7477D7A9D(EPathFollowingResult Result, class AAIController* AIController);
	void OnFinish_46520BF64782D787A829259B1AEBC2F9();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_SurvivorWander_C">();
	}
	static class UGAB_SurvivorWander_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_SurvivorWander_C>();
	}
};

}

