#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoginScreen

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoginScreen.LoginScreen_C
// 0x0080 (0x0560 - 0x04E0)
class ULoginScreen_C final  : public UFortUIStateWidget_Login
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          BackBorder;                                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      BackButton;                                        // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConsoleProfileWidget_C*                ConsoleProfileWidget;                              // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetStack*                     LoginFlowStack;                                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBuildWatermark_C*                      Widget_BuildWatermark;                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AFort_Entry_Music_Controller_BP_C*      FrontEnd_Music_Controller;                         // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUserWidget*                      AccountLinkWindow;                                 // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLoginMenuVisible;                                 // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C67[0x7];                                     // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BenchmarkDialogTitle_0;                            // 0x0528(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   BenchmarkDialogMessage_0;                          // 0x0540(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UObject*                                LoginMenuWidget;                                   // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LoginScreen(int32 EntryPoint, bool K2Node_CustomEvent_bSuccessful, class FText K2Node_CustomEvent_EULAText, TDelegate<void(bool bSuccessful, class FText EULAText)> K2Node_CreateDelegate_OutputDelegate, TArray<class AFort_Entry_Music_Controller_BP_C*>& CallFunc_GetAllActorsOfClass_OutActors, int32 CallFunc_Array_Length_ReturnValue, class UFortMcpContext* CallFunc_GetContext_ReturnValue, class FText CallFunc_GetEULAText_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate1, bool CallFunc_HasEULADownloaded_ReturnValue, EFortUIState K2Node_Event_PreviousUIState, int32 Temp_int_Array_Index_Variable, class AFort_Entry_Music_Controller_BP_C* CallFunc_Array_Get_Item, class FText K2Node_CustomEvent_StatusText, class FText K2Node_CustomEvent_FailReason, bool CallFunc_StartAutoLogin_ReturnValue, class UWidget* K2Node_Event_Widget1, const struct FContentPushState& K2Node_Event_State, TDelegate<void(class UWidget* WebWidget)> K2Node_CreateDelegate_OutputDelegate12, class UCommonButton* K2Node_ComponentBoundEvent_Button, int32 CallFunc_GetChildrenCount_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_GetChildrenCount_ReturnValue1, bool CallFunc_Greater_IntInt_ReturnValue1, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue1, bool K2Node_Event_bLinkedAccountNeedsPurchase, class UFortMcpContext* CallFunc_GetContext_ReturnValue12, class FText K2Node_Event_Reason, class UFortFrontEndContext* CallFunc_GetContext_ReturnValue123, bool K2Node_Event_bShow, class FText K2Node_Event_Tile, class FText K2Node_Event_Body, class UFortUIManagerWidget_NUI* CallFunc_GetUIManagerWidget_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UMOTD_C* CallFunc_Create_ReturnValue, bool CallFunc_IsLoggedIn_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate123, class UWidget* K2Node_CustomEvent_WebWidget, bool CallFunc_CloseWebLogin_bWasClosed, class UWidget* K2Node_Event_Widget, EFortUIState K2Node_Event_NextUIState, int32 Temp_int_Loop_Counter_Variable, class UFortFrontEndContext* CallFunc_GetContext_ReturnValue1234, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue);
	void OnEulaDownloadComplete(bool bSuccessful, class FText EULAText);
	void OnExitState(EFortUIState NextUIState);
	void HandleLoginResultConfirmed();
	void RollbackStackToSplashScreen();
	void SafePopFlowStack();
	void EmptyFlowStack();
	void ActivateWidgetOnFlowStack();
	void PushWidgetOntoFlowStack(class UWidget* Widget);
	void OnWebLoginClosed();
	void OnWebLoginDisplay(class UWidget* WebWidget);
	void Event_Closed_MOTD();
	void OnShowLoginMessage(bool bShow, class FText& Tile, class FText& Body);
	void OnPostLoginLogoutComplete(class FText& Reason);
	void OnNeedsPurchaseOrAccountLinking(bool bLinkedAccountNeedsPurchase);
	void AccountLinking_ViewEula();
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void PushContentWidgetInternal(class UWidget* Widget, const struct FContentPushState& State);
	void AccountLinking_RequestAutoLogin();
	void AccountLinking_RequestSignIn();
	void AccountLinking_LinkingFailed(class FText FailReason);
	void AccountLinking_PopStatus();
	void AccountLinking_PushStatus(class FText StatusText);
	void OnLoginSuceeded();
	void OnEnterState(EFortUIState PreviousUIState);
	void Construct();
	void ShowAccountLinkingWindow(bool InLinkedAccountNeedsPurchase, class FText CallFunc_GetPlatformDisplayName_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate1, TDelegate<void(class FText FailReason)> K2Node_CreateDelegate_OutputDelegate12, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate123, TDelegate<void(class FText StatusText)> K2Node_CreateDelegate_OutputDelegate1234, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate12345, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UAccountLinkingWindow_C* CallFunc_Create_ReturnValue, class UAccountLinkingWindow_C* K2Node_DynamicCast_AsAccount_Linking_Window, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue);
	void ToggleLoginMenu(bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable1, bool CallFunc_Not_PreBool_ReturnValue, ESlateVisibility K2Node_Select_Default);
	struct FEventReply OnMouseButtonUp_MenuBorder(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	class UWidget* GetLoginMenu();
	class UWidget* PopContentWidgetInternal(const struct FContentPushState& State, class UWidget* CallFunc_PopWigdet_ReturnValue);
	void RollbackToSplashScreen(class UWidget* CallFunc_PopWigdet_ReturnValue, int32 CallFunc_GetChildrenCount_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);
	void HideNonSplashScreenContent();
	void EmptyLoginStack(int32 CallFunc_GetChildrenCount_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, class UWidget* CallFunc_PopWigdet_ReturnValue);
	void SafePopContent(int32 CallFunc_GetChildrenCount_ReturnValue, class UWidget* CallFunc_PopWigdet_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);
	void CloseWebLogin(bool* bWasClosed, class UFortMcpContext* CallFunc_GetContext_ReturnValue, class UWidget* CallFunc_GetActiveWidget_ReturnValue, class UWebLogin_C* K2Node_DynamicCast_AsWeb_Login, bool K2Node_DynamicCast_bSuccess);
	void DismissWebLogin(int32 CallFunc_GetChildrenCount_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);
	void ShowExternalLogin(class UWidget* NativeWidget, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UWebLogin_C* CallFunc_Create_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoginScreen_C">();
	}
	static class ULoginScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoginScreen_C>();
	}
};

}

