#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Male_Commando_UR01_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Male_Commando_UR01_AnimBlueprint.Male_Commando_UR01_AnimBlueprint_C
// 0x08D0 (0x0D00 - 0x0430)
class UMale_Commando_UR01_AnimBlueprint_C final  : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_6414C3A9462238C4E2C31888D8C866B7; // 0x0438(0x0068)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9FE36C74433A926859049F84F5E7DB63; // 0x04A0(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2BEC3F0D410B9D2536DE458C8A2DEB5C; // 0x04E8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_B130534148BB27F3DB497EBE460C22C7; // 0x0530(0x0048)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_AF61F2804F0D8DC21CF782911359D1FF; // 0x0578(0x0280)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_93EB4AD7448803E2417DEB9D2214A45A; // 0x07F8(0x0280)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6A811C1047E022162499EC8602AEAA66; // 0x0A78(0x0280)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x0CF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_Male_Commando_UR01_AnimBlueprint(int32 EntryPoint, class USkeletalMeshComponent* CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Male_Commando_UR01_AnimBlueprint_C">();
	}
	static class UMale_Commando_UR01_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMale_Commando_UR01_AnimBlueprint_C>();
	}
};

}

