#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinibossDetails

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MinibossDetails.MinibossDetails_C
// 0x0050 (0x02A8 - 0x0258)
class UMinibossDetails_C final  : public UFortHUDTargetUnderReticleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       KillMinusAnimation;                                // 0x0260(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OutroMinusAnimation;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroMinusAnimation;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBasicProgressBar_C*                    BasicProgressBar;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePortrait;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxShell;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextModifiers;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextUpgradeName;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MinibossDetails(int32 EntryPoint, float CallFunc_GetHUDTargetHealthPercentage_ReturnValue, float CallFunc_GetHUDTargetHealthPercentage_ReturnValue1, class FText CallFunc_GetHUDTargetUpgradeDisplayName_ReturnValue, class FText CallFunc_GetHUDTargetDisplayName_ReturnValue, TArray<class FText>& CallFunc_GetHUDTargetDisplayModifiers_ReturnValue, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue1, bool CallFunc_IsValid_ReturnValue1, bool CallFunc_IsVisible_ReturnValue);
	void OnTargetDestroyed();
	void OnTargetDied();
	void OnTargetHealthChanged();
	void OnTargetChanged();
	void InitializeMiniBossDetails(TArray<class FText>& InModifiers, class FText InName, class FText InUpgradeName, float InHealthPercent, bool ShowName, bool ShowPortrait, class UClass* NameStyle, class UClass* ModifiersStyle, ETextJustify Name_Alignment, ETextJustify Modifiers_Alignment, float Health_Bar_Width, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable1, bool CallFunc_TextIsEmpty_ReturnValue, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable12, ESlateVisibility Temp_byte_Variable123, bool Temp_bool_Variable1, ESlateVisibility K2Node_Select_Default, ESlateVisibility K2Node_Select1_Default);
	void PopulateModifiers(TArray<class FText>& InModifiersArray, class FText Temp_text_Variable, int32 Temp_int_Array_Index_Variable, bool CallFunc_LessEqual_IntInt_ReturnValue, class FText CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, class FText CallFunc_GetEmptyText_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool Temp_bool_Variable, bool CallFunc_Less_IntInt_ReturnValue, class FText K2Node_Select_Default, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData1, int32 CallFunc_Add_IntInt_ReturnValue, class FText CallFunc_GetEmptyText_ReturnValue1, class FText CallFunc_GetText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData12, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue);
	void Update_Health(float InPercent);
	void Intro(bool CallFunc_IsAnimationPlaying_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_IsAnimationPlaying_ReturnValue1);
	void Outro(bool CallFunc_IsAnimationPlaying_ReturnValue, bool CallFunc_IsAnimationPlaying_ReturnValue1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_IsVisible_ReturnValue);
	void Kill(bool CallFunc_IsAnimationPlaying_ReturnValue, bool CallFunc_IsAnimationPlaying_ReturnValue1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_IsVisible_ReturnValue);
	void OnKillAnimationFinished(TDelegate<void()> K2Node_CreateDelegate_OutputDelegate);
	void StopKillAnimation(TDelegate<void()> K2Node_CreateDelegate_OutputDelegate);
	void OnOutroAnimationFinished(TDelegate<void()> K2Node_CreateDelegate_OutputDelegate);
	void StopOutroAnimation(TDelegate<void()> K2Node_CreateDelegate_OutputDelegate);
	void OnIntroAnimationFinished(TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void StopIntroAnimation(TDelegate<void()> K2Node_CreateDelegate_OutputDelegate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MinibossDetails_C">();
	}
	static class UMinibossDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMinibossDetails_C>();
	}
};

}

