#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionAlertIndicator

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MissionAlertIndicator.MissionAlertIndicator_C.ToggleTimer
// 0x0020 (0x0020 - 0x0000)
struct MissionAlertIndicator_C_ToggleTimer final 
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_435E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor)
};

// Function MissionAlertIndicator.MissionAlertIndicator_C.Config
// 0x00F8 (0x00F8 - 0x0000)
struct MissionAlertIndicator_C_Config final 
{
public:
	struct FGameplayTagContainer                  AlertVisualTags;                                   // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x0020(0x0048)()
	bool                                          CallFunc_DoesContainerMatchTagQuery_ReturnValue;   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_435F[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_Get_Mission_Alert_Visual_Icon_OutBrush;   // 0x0070(0x0078)()
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x00E8(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function MissionAlertIndicator.MissionAlertIndicator_C.Get Mission Alert Visual Icon
// 0x01A0 (0x01A0 - 0x0000)
struct MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon final 
{
public:
	struct FGameplayTagContainer                  TagContainer;                                      // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSlateBrush                            OutBrush;                                          // 0x0020(0x0078)(Parm, OutParm)
	class UObject*                                MinibossAlertImage;                                // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                StormAlertImage;                                   // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00A8(0x0078)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue1;                      // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4360[0x6];                                     // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush1;                     // 0x0128(0x0078)()
};

}

