#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PopupCenterMessageModalPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PopupCenterMessageModalPanel.PopupCenterMessageModalPanel_C
// 0x0078 (0x0460 - 0x03E8)
class UPopupCenterMessageModalPanel_C final  : public UFortActivatablePanel
{
public:
	uint8                                         Pad_23F9[0x8];                                     // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       CenterMessageText;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULeaveButton_C*                         LeaveButton;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MessageOverlay;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   WaitingForPlayersText;                             // 0x0410(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   WaitingForOutpostOwnerText;                        // 0x0428(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           MatchTimerHandle;                                  // 0x0440(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FText                                   WaitingForMatchToBeginText;                        // 0x0448(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_PopupCenterMessageModalPanel(int32 EntryPoint, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_UpdateMatchTimerText_StopTimer, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, class UFortUINavigationManager* CallFunc_GetUINavigationManager_ReturnValue);
	void OnActivated();
	void StartMatchTimer();
	void UpdateMatchTimer();
	void UpdateState(ECenterPopupMessageStateEnum NewState, class FText CurrentMessage, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_UpdateMatchTimerText_StopTimer, bool CallFunc_Not_PreBool_ReturnValue);
	void UpdateMatchTimerText(bool* StopTimer, int32 CurrentCount, bool CallFunc_LessEqual_IntInt_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class FText CallFunc_Format_ReturnValue, class AFortGameStatePvP* K2Node_DynamicCast_AsFort_Game_State_Pv_P, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_GetStartMatchDelayTimer_ReturnValue);
	void LeaveZone(class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue, class UFortPartyContext* CallFunc_GetContext_ReturnValue1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PopupCenterMessageModalPanel_C">();
	}
	static class UPopupCenterMessageModalPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPopupCenterMessageModalPanel_C>();
	}
};

}

