#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuickbarSlot

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "ItemDisplayStyle_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuickbarSlot.QuickbarSlot_C
// 0x0148 (0x0358 - 0x0210)
class UQuickbarSlot_C : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0218(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimMaximize;                                      // 0x0220(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimMinimize;                                      // 0x0228(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               _SizeBox__Item;                                    // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BottomHoldText;                                    // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomLeftArrowImage;                              // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomLeftArrowImage2;                             // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomRightArrowImage;                             // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomRightArrowImage2;                            // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Empty;                                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 ItemCardMaximized;                                 // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 ItemCardMinimized;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindBottom;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindBottomCombo1;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindBottomCombo2;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindBottomComboArrow1;                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindBottomComboArrow2;                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindTop;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindTopCombo1;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindTopCombo2;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindTopComboArrow1;                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindTopComboArrow2;                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuickbarSlotCooldown_C*                QuickbarSlotCooldown;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       QuickBarSlotInvalidationBox;                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selection;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxBottomKeybind;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxTopKeybind;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SlotInteraction;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherBottomComboSwitcher;                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherTopComboSwitcher;                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopLeftArrowImage;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopLeftArrowImage2;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopRightArrowImage;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopRightArrowImage2;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuickBars                                QuickBarType;                                      // 0x032C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EItemDisplayStyle                             ItemDisplayStyle;                                  // 0x032D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemCardSize                             ItemCardSize;                                      // 0x032E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowBottomArrows;                                 // 0x032F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bShowTopArrows;                                    // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          DoNotPlaySelectionAnimation;                       // 0x0331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bHideKeybindsWhenAbilityUnavailable;               // 0x0332(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bKeybindsHidden;                                   // 0x0333(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36AB[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemCooldownType>                 CooldownTypesSupported;                            // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class UFortItem*                              Item;                                              // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimatedBoxScaleFactor;                            // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	EFortItemCardSize                             MinimumCardSize;                                   // 0x0354(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemCardSize                             MaximumCardSize;                                   // 0x0355(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldCollapseItemWidgetBorder;                    // 0x0356(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_QuickbarSlot(int32 EntryPoint, class UTexture2D* Temp_object_Variable, class UTexture2D* Temp_object_Variable1, class UTexture2D* Temp_object_Variable12, class UTexture2D* Temp_object_Variable123, class UTexture2D* Temp_object_Variable1234, class UTexture2D* Temp_object_Variable12345, class UFortInventoryContext* CallFunc_GetContext_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate1, class UFortInventoryContext* CallFunc_GetContext_ReturnValue1, class UTexture2D* Temp_object_Variable123456, bool K2Node_SwitchEnum_CmpSuccess, bool K2Node_Event_IsDesignTime, bool CallFunc_IsSlotHidden_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class UFortWorldItem* K2Node_DynamicCast_AsFort_World_Item, bool K2Node_DynamicCast_bSuccess, EFortItemCardSize CallFunc_GetCardSize_ReturnValue, EFortItemCardSize CallFunc_GetCardSize_ReturnValue1, EItemDisplayStyle Temp_byte_Variable, class UTexture2D* K2Node_Select_Default, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate12, class UFortItem* CallFunc_GetQuickBarSlottedItem_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate123, float K2Node_CustomEvent_AnimatedBoxScaleFactor);
	void SetAnimatedBoxScaleFactor(float Param_AnimatedBoxScaleFactor);
	void Construct();
	void HandleMinimizeStarted();
	void HandleMaximizeFinished();
	void RefreshItem();
	void HandleMinimizeFinished();
	void HandleMaximizeStarted();
	void PreConstruct(bool IsDesignTime);
	void SetSelected(bool Param_Selected, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable1, class UCommonUIContext* CallFunc_GetContext_ReturnValue, bool CallFunc_IsUsingGamepad_ReturnValue, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable12, ESlateVisibility Temp_byte_Variable123, ESlateVisibility K2Node_Select_Default, bool Temp_bool_Variable1, ESlateVisibility Temp_byte_Variable1234, ESlateVisibility Temp_byte_Variable12345, bool Temp_bool_Variable12, bool CallFunc_BooleanAND_ReturnValue, ESlateVisibility K2Node_Select1_Default, bool CallFunc_BooleanAND_ReturnValue1, ESlateVisibility K2Node_Select12_Default, float CallFunc_GetEndTime_ReturnValue);
	void Minimize(bool ShouldSkipAnimation, bool CallFunc_IsAnimationPlaying_ReturnValue);
	void Maximize(bool ShouldSkipAnimation, bool CallFunc_IsAnimationPlaying_ReturnValue);
	void Resize(EFortItemCardSize Card_Size);
	void UpdateKeyBindingText(ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable1, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue, bool CallFunc_IsUsingGamepad_ReturnValue, bool Temp_bool_Variable, bool CallFunc_IsHoldKeybind_ReturnValue, bool CallFunc_IsVisible_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, ESlateVisibility K2Node_Select_Default, bool CallFunc_EqualEqual_IntInt_ReturnValue, class FName CallFunc_GetKeyBindingAction_KeyBindingAction, bool CallFunc_BooleanAND_ReturnValue1, class FName CallFunc_GetKeyBindingAction_KeyBindingAction1, bool K2Node_SwitchEnum_CmpSuccess);
	void UpdateKeyBindingVisibility(ESlateVisibility Temp_byte_Variable, class UFortInventoryContext* CallFunc_GetContext_ReturnValue, EFortQuickBars CallFunc_GetQuickbarFocus_OutQuickBar, int32 CallFunc_GetQuickbarFocus_OutSlot, int32 CallFunc_GetQuickbarFocus_OutSecondarySlot, int32 CallFunc_GetQuickbarFocus_OutPreviousFocusedSlot, class UFortHUDContext* CallFunc_GetContext_ReturnValue1, bool Temp_bool_Variable, bool CallFunc_ShouldOnlyShowNextPrevBuildingSlotKeybinds_ReturnValue, ESlateVisibility Temp_byte_Variable1, bool CallFunc_Not_PreBool_ReturnValue, ESlateVisibility Temp_byte_Variable12, bool Temp_bool_Variable1, ESlateVisibility Temp_byte_Variable123, ESlateVisibility Temp_byte_Variable1234, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue12, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue123, bool CallFunc_IsUsingGamepad_ReturnValue, bool CallFunc_IsUsingGamepad_ReturnValue1, ESlateVisibility Temp_byte_Variable12345, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_IsValid_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool Temp_bool_Variable12, bool CallFunc_EqualEqual_ByteByte_ReturnValue1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue1, ESlateVisibility K2Node_Select_Default, bool CallFunc_EqualEqual_IntInt_ReturnValue, ESlateVisibility Temp_byte_Variable123456, bool CallFunc_EqualEqual_ByteByte_ReturnValue12, bool CallFunc_BooleanAND_ReturnValue12, ESlateVisibility Temp_byte_Variable1234567, bool CallFunc_BooleanAND_ReturnValue123, bool Temp_bool_Variable123, ESlateVisibility K2Node_Select1_Default, ESlateVisibility K2Node_Select12_Default, ESlateVisibility K2Node_Select123_Default, bool CallFunc_IsHoldKeybind_ReturnValue, bool CallFunc_IsVisible_ReturnValue, bool CallFunc_BooleanAND_ReturnValue1234, bool K2Node_SwitchEnum1_CmpSuccess);
	void InitializeCooldowns(TDelegate<void(EFortItemCooldownType CooldownType)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(EFortItemCooldownType CooldownType)> K2Node_CreateDelegate_OutputDelegate1);
	void OnCooldownStarted(EFortItemCooldownType CooldownType, bool K2Node_SwitchEnum_CmpSuccess);
	void OnCooldownStopped(EFortItemCooldownType CooldownType, bool K2Node_SwitchEnum_CmpSuccess);
	void UpdateItemCardsVisibility(ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable1, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable12, EFortItemCardSize CallFunc_GetCardSize_ReturnValue, ESlateVisibility Temp_byte_Variable123, bool CallFunc_EqualEqual_ByteByte_ReturnValue, EFortItemCardSize CallFunc_GetCardSize_ReturnValue1, bool Temp_bool_Variable1, bool CallFunc_EqualEqual_ByteByte_ReturnValue1, ESlateVisibility K2Node_Select_Default, ESlateVisibility K2Node_Select1_Default, bool CallFunc_IsValid_ReturnValue);
	void UpdateItemBoxSize(EFortItemType Item_Type_To_Show, bool Temp_bool_Variable, bool Temp_bool_Variable1, bool CallFunc_ShouldUseNewItemCards_ReturnValue, EFortItemCardSize CallFunc_GetCardSize_ReturnValue, class UOverlaySlot* CallFunc_SlotAsOverlaySlot_ReturnValue, bool CallFunc_IsValid_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, EFortItemType K2Node_Select_Default, float CallFunc_Add_FloatFloat_ReturnValue1, const struct FVector2D& CallFunc_GetCardDimensions_ReturnValue, bool CallFunc_IsValid_ReturnValue1, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, float CallFunc_Add_FloatFloat_ReturnValue12, float CallFunc_Add_FloatFloat_ReturnValue123, EFortItemType CallFunc_GetType_ReturnValue, EFortItemCardSize CallFunc_GetCardSize_ReturnValue1, class UOverlaySlot* CallFunc_SlotAsOverlaySlot_ReturnValue1, EFortItemType K2Node_Select1_Default, const struct FVector2D& CallFunc_GetCardDimensions_ReturnValue1, float CallFunc_Add_FloatFloat_ReturnValue1234, float CallFunc_BreakVector2D_X1, float CallFunc_BreakVector2D_Y1, float CallFunc_Add_FloatFloat_ReturnValue12345, float CallFunc_Add_FloatFloat_ReturnValue123456, float CallFunc_Add_FloatFloat_ReturnValue1234567, float CallFunc_Lerp_ReturnValue, float CallFunc_Lerp_ReturnValue1);
	void InitializeInvalidation(class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue, EFortUIFeatureState CallFunc_GetFeatureState_OutFeatureState, EFortUIFeatureStateReason CallFunc_GetFeatureState_OutReason, bool K2Node_SwitchEnum_CmpSuccess);
	void SetTopComboSwitcherVisibility(ESlateVisibility InVisibility, bool CallFunc_IsMobileGame_ReturnValue);
	void SetBottomComboSwitcherVisibility(ESlateVisibility InVisibility, bool CallFunc_IsMobileGame_ReturnValue);

	void GetKeyBindingAction(class FName* KeyBindingAction, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue, class FName CallFunc_GetKeyBindingAction_Keyboard_Key_Binding_Action, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsUsingGamepad_ReturnValue, class FName CallFunc_GetKeyBindingAction_Gamepad_KeyBindingAction) const;
	void GetKeyBindingAction_Keyboard(class FName* Key_Binding_Action, EFortQuickBars Temp_byte_Variable, const class FString& Temp_string_Variable, int32 CallFunc_Add_IntInt_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& K2Node_Select_Default, const class FString& CallFunc_Concat_StrStr_ReturnValue1, class FName CallFunc_Conv_StringToName_ReturnValue) const;
	void GetKeyBindingAction_Gamepad(class FName* KeyBindingAction, bool OnlyShowBuildingPieceNextPrevKeybinds, int32 FocusedSlotIndex, bool IsPreviousSlot, bool IsFocusedSlot, class FName CallFunc_GetKeyBindingAction_Keyboard_Key_Binding_Action, bool K2Node_SwitchInteger_CmpSuccess, class FName CallFunc_GetKeyBindingAction_Keyboard_Key_Binding_Action1, bool CallFunc_EqualEqual_IntInt_ReturnValue, class FName CallFunc_GetKeyBindingAction_Keyboard_Key_Binding_Action12, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanOR_ReturnValue1, bool CallFunc_EqualEqual_IntInt_ReturnValue1, class FName CallFunc_GetKeyBindingAction_Keyboard_Key_Binding_Action123, bool CallFunc_BooleanAND_ReturnValue1, bool CallFunc_BooleanOR_ReturnValue12, class UFortInventoryContext* CallFunc_GetContext_ReturnValue, EFortQuickBars CallFunc_GetQuickbarFocus_OutQuickBar, int32 CallFunc_GetQuickbarFocus_OutSlot, int32 CallFunc_GetQuickbarFocus_OutSecondarySlot, int32 CallFunc_GetQuickbarFocus_OutPreviousFocusedSlot, bool CallFunc_EqualEqual_IntInt_ReturnValue12, bool CallFunc_EqualEqual_IntInt_ReturnValue123, bool CallFunc_EqualEqual_IntInt_ReturnValue1234, bool CallFunc_BooleanOR_ReturnValue123, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class UFortHUDContext* CallFunc_GetContext_ReturnValue1, bool CallFunc_ShouldOnlyShowNextPrevBuildingSlotKeybinds_ReturnValue, bool K2Node_SwitchInteger1_CmpSuccess, bool K2Node_SwitchEnum_CmpSuccess, bool K2Node_SwitchInteger12_CmpSuccess) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuickbarSlot_C">();
	}
	static class UQuickbarSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuickbarSlot_C>();
	}
};

}

