#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedirectToEpicAccount

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function RedirectToEpicAccount.RedirectToEpicAccount_C.ExecuteUbergraph_RedirectToEpicAccount
// 0x0018 (0x0018 - 0x0000)
struct RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount final 
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2990[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bImportEnabled;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortLoginAccountType                         K2Node_Event_AccountType;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function RedirectToEpicAccount.RedirectToEpicAccount_C.BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct RedirectToEpicAccount_C_BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final 
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function RedirectToEpicAccount.RedirectToEpicAccount_C.UpdateNewAccountText
// 0x0002 (0x0002 - 0x0000)
struct RedirectToEpicAccount_C_UpdateNewAccountText final 
{
public:
	bool                                          bImportEnabled;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortLoginAccountType                         AccountType;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

