#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Results_TeleportPad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Results_TeleportPad.Results_TeleportPad_C
// 0x00E8 (0x0358 - 0x0270)
class UResults_TeleportPad_C final  : public UFortResultsTeleportScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_ExitButtonIntro;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ExitTimeTick;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ExitEnabled;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonExit;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageTimer;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayRoot;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayTimer;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UResults_TeleportPadPlayer_C*           Pad1;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UResults_TeleportPadPlayer_C*           Pad2;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UResults_TeleportPadPlayer_C*           Pad3;                                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UResults_TeleportPadPlayer_C*           Pad4;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                TextExitTime;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UResults_TeleportPadPlayer_C*>   TeleportPadsOrdered;                               // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	UMulticastDelegateProperty_                   OnMissionStatsClicked;                             // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnExitClicked;                                     // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USoundBase*                             ExitButtonIntro;                                   // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bExitTimeFinished;                                 // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B2[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ExitingText;                                       // 0x0318(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	UMulticastDelegateProperty_                   OnAddFriendClicked;                                // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnUpVoteClicked;                                   // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsSolo;                                           // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EFortCompletionResult                         CompletionResult;                                  // 0x0351(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnMissionStatsClicked__DelegateSignature();
	void OnExitClicked__DelegateSignature();
	void OnAddFriendClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void OnUpVoteClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void ExecuteUbergraph_Results_TeleportPad(int32 EntryPoint, bool CallFunc_Should_Hide_Exit_Timer_bHideExitTimer, bool Temp_bool_A_Execution_Happened_Variable, bool Temp_bool_B_Execution_Happened_Variable, bool CallFunc_BooleanAND_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Loop_Counter_Variable1, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue1, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable12, int32 CallFunc_Add_IntInt_ReturnValue12, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue1, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue1, int32 Temp_int_Array_Index_Variable1, int32 Temp_int_Array_Index_Variable12, class UResults_TeleportPadPlayer_C* CallFunc_Array_Get_Item, bool CallFunc_IsValidPad_bIsValid, class UResults_TeleportPadPlayer_C* CallFunc_Array_Get_Item1, int32 CallFunc_Array_Length_ReturnValue12, bool CallFunc_IsValidPad_bIsValid1, int32 K2Node_Event_TimeRemainingSeconds, float CallFunc_Conv_IntToFloat_ReturnValue, float K2Node_Event_Percent, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, const struct FUniqueNetIdRepl& K2Node_ComponentBoundEvent_TargetId1234567, const class FString& K2Node_ComponentBoundEvent_TargetName1234567, class UResults_TeleportPadPlayer_C* CallFunc_Array_Get_Item12, bool CallFunc_IsValidPad_bIsValid12, int32 CallFunc_Array_Length_ReturnValue123, bool CallFunc_Less_IntInt_ReturnValue12, const struct FUniqueNetIdRepl& K2Node_ComponentBoundEvent_TargetId123456, const class FString& K2Node_ComponentBoundEvent_TargetName123456, const struct FUniqueNetIdRepl& K2Node_ComponentBoundEvent_TargetId12345, const class FString& K2Node_ComponentBoundEvent_TargetName12345, const struct FUniqueNetIdRepl& K2Node_ComponentBoundEvent_TargetId1234, const class FString& K2Node_ComponentBoundEvent_TargetName1234, const struct FUniqueNetIdRepl& K2Node_ComponentBoundEvent_TargetId123, const class FString& K2Node_ComponentBoundEvent_TargetName123, const struct FUniqueNetIdRepl& K2Node_ComponentBoundEvent_TargetId12, const class FString& K2Node_ComponentBoundEvent_TargetName12, const struct FUniqueNetIdRepl& K2Node_ComponentBoundEvent_TargetId1, const class FString& K2Node_ComponentBoundEvent_TargetName1, const struct FUniqueNetIdRepl& K2Node_ComponentBoundEvent_TargetId, const class FString& K2Node_ComponentBoundEvent_TargetName, class UCommonButton* K2Node_ComponentBoundEvent_Button, class UResults_TeleportPadPlayer_C* K2Node_ComponentBoundEvent_TeleportPadPlayer123, class UResults_TeleportPadPlayer_C* K2Node_ComponentBoundEvent_TeleportPadPlayer12, bool CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad, bool CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad1, class UResults_TeleportPadPlayer_C* K2Node_ComponentBoundEvent_TeleportPadPlayer1, class UResults_TeleportPadPlayer_C* K2Node_ComponentBoundEvent_TeleportPadPlayer, bool CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad12, bool CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad123, int32 Temp_int_Loop_Counter_Variable123, int32 Temp_int_Array_Index_Variable123, class UResults_TeleportPadPlayer_C* CallFunc_Array_Get_Item123, bool CallFunc_IsValidPad_bIsValid123, bool CallFunc_Less_IntInt_ReturnValue123, int32 CallFunc_Add_IntInt_ReturnValue123, bool CallFunc_Should_Hide_Exit_Timer_bHideExitTimer1);
	void BndEvt__Pad4_K2Node_ComponentBoundEvent_7_OnTeleportPadIntroFinished__DelegateSignature(class UResults_TeleportPadPlayer_C* TeleportPadPlayer);
	void BndEvt__Pad3_K2Node_ComponentBoundEvent_6_OnTeleportPadIntroFinished__DelegateSignature(class UResults_TeleportPadPlayer_C* TeleportPadPlayer);
	void BndEvt__Pad2_K2Node_ComponentBoundEvent_5_OnTeleportPadIntroFinished__DelegateSignature(class UResults_TeleportPadPlayer_C* TeleportPadPlayer);
	void BndEvt__Pad1_K2Node_ComponentBoundEvent_4_OnTeleportPadIntroFinished__DelegateSignature(class UResults_TeleportPadPlayer_C* TeleportPadPlayer);
	void BndEvt__ButtonReturnHome_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_6_OnUpVoteClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_5_OnUpVoteClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_4_OnUpVoteClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_3_OnUpVoteClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_2_OnAddFriendClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_1_OnAddFriendClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_0_OnAddFriendClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_35_OnAddFriendClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void OnExitTimePercentagePassedUpdated(float Percent);
	void OnExitTimeRemainingUpdated(int32 TimeRemainingSeconds);
	void OnExitTimerFinished();
	void BndEvt__Anim_ExitEnabled_K2Node_ComponentBoundEvent_1_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void BndEvt__Anim_ExitButtonIntro_K2Node_ComponentBoundEvent_0_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void ExitButtonShown();
	void BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_4_OnMissionStatsClicked__DelegateSignature();
	void BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_3_OnMissionStatsClicked__DelegateSignature();
	void BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_2_OnMissionStatsClicked__DelegateSignature();
	void BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_1_OnMissionStatsClicked__DelegateSignature();
	void Teleport_Pad_Screen_Intro();
	void Team_Score_Screen_Outro();
	void Team_Score_Screen_Intro();
	void Initialize(class UFortUIScoreReport* InScoreReport, EFortCompletionResult Param_CompletionResult, class UResults_TeleportPadPlayer_C* CurrentTeleportPad, int32 CurrentScoreReportIndex, class UFortUIScoreReport* ScoreReport, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, int32 CallFunc_GetPlayerCount_ReturnValue, TArray<int32>& CallFunc_GetScoreReportIndicesByPlayerID_SortedScoreReportIndices, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_GetPlayerCount_ReturnValue1, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 Temp_int_Variable, class UResults_TeleportPadPlayer_C* CallFunc_Array_Get_Item, class UResults_TeleportPadPlayer_C* CallFunc_Array_Get_Item1, int32 CallFunc_Array_Get_Item12, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UResults_TeleportPadPlayer_C*>& K2Node_MakeArray_Array, class AFortPlayerPawn* CallFunc_GetCurrentPlayerPawn_ReturnValue, bool CallFunc_IsValid_ReturnValue, class AFortPlayerState* K2Node_DynamicCast_AsFort_Player_State, bool K2Node_DynamicCast_bSuccess, const struct FUniqueNetIdRepl& CallFunc_GetPlatformUniqueNetId_ReturnValue, const struct FUniqueNetIdRepl& CallFunc_GetUniqueID_ReturnValue, bool CallFunc_IsValidNetID_ReturnValue);
	void Focus(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UResults_TeleportPadPlayer_C* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad, bool CallFunc_IsValidPad_bIsValid, bool CallFunc_BooleanAND_ReturnValue);
	void Disable();
	void Enable();
	void Should_Hide_Exit_Timer(bool* bHideExitTimer, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_BooleanOR_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Results_TeleportPad_C">();
	}
	static class UResults_TeleportPad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResults_TeleportPad_C>();
	}
};

}

