#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatNumericTextBlock

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StatNumericTextBlock.StatNumericTextBlock_C
// 0x0028 (0x0238 - 0x0210)
class UStatNumericTextBlock_C final  : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 ComparisonArrowImage;                              // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                NumericText;                                       // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EFortBuffState                                Buff_State;                                        // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F67[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Numeric_Text_Style;                                // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StatNumericTextBlock(int32 EntryPoint, bool K2Node_Event_IsDesignTime);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void UpdateComparison(ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable1, EFortBuffState Temp_byte_Variable12, ESlateVisibility Temp_byte_Variable123, EFortBuffState Temp_byte_Variable1234, ESlateVisibility K2Node_Select_Default, float Temp_float_Variable, float Temp_float_Variable1, float Temp_float_Variable12, EFortBuffState Temp_byte_Variable12345, float K2Node_Select1_Default, const struct FLinearColor& CallFunc_Get_Base___Buff_Colors_Base, const struct FLinearColor& CallFunc_Get_Base___Buff_Colors_Buff, const struct FLinearColor& K2Node_Select12_Default, const struct FSlateColor& K2Node_MakeStruct_SlateColor);
	void SetComparisonState(EFortBuffState Param_Buff_State);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StatNumericTextBlock_C">();
	}
	static class UStatNumericTextBlock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatNumericTextBlock_C>();
	}
};

}

