#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SupplyDropUnlocks

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct SupplyDropUnlocks.SupplyDropUnlocks
// 0x0005 (0x0005 - 0x0000)
struct FSupplyDropUnlocks final 
{
public:
	bool                                          TierOne_5_9D1EB309486DD183FED684B8EEAF54B7;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TierTwo_6_58AB58B441DB6EDC4FEA21ABD0C17475;        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TierThree_7_F54FF5FC4D92FACF83CB69B88043A65F;      // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TierFour_8_6C40909A4282BD0806479A8DD34449EB;       // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TierFive_9_0B433AC44B7DBA126B7872BD5EC513DA;       // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

