#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabVideoOptions

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TabVideoOptions.TabVideoOptions_C
// 0x00B0 (0x0330 - 0x0280)
class UTabVideoOptions_C final  : public UFortVideoOptions
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(Transient, DuplicateTransient)
	class UResolutionScaleSlider_C*               ThreeDResolution;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuRowSelector_C*              AntiMinusAliasing;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                     DisplayResolution;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuRowSelector_C*              Effects;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                     FrameRateLimit;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                     MotionBlur;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuRowSelector_C*              PostProcessing;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuRowSelector_C*              Quality;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuRowSelector_C*              Shadows;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                     ShowFPS;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                     ShowGrass;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuRowSelector_C*              Textures;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TooltipDisplay;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuRowSelector_C*              ViewDistance;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                     VSync;                                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                     WindowMode;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   Enable_Overlay;                                    // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   Disable_Overlay;                                   // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Enable_Overlay__DelegateSignature(bool Accept_Input);
	void Disable_Overlay__DelegateSignature();
	void ExecuteUbergraph_TabVideoOptions(int32 EntryPoint, float K2Node_CustomEvent_Slider_Value, bool Temp_bool_Variable, TDelegate<void(int32 Tab_Id)> K2Node_CreateDelegate_OutputDelegate, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable1, TDelegate<void(int32 Selected_Index)> K2Node_CreateDelegate_OutputDelegate1, TDelegate<void(int32 Selected_Index)> K2Node_CreateDelegate_OutputDelegate12, TDelegate<void(int32 Selected_Index)> K2Node_CreateDelegate_OutputDelegate123, TDelegate<void(int32 Selected_Index)> K2Node_CreateDelegate_OutputDelegate1234, bool Temp_bool_Variable1, ESlateVisibility Temp_byte_Variable12, ESlateVisibility Temp_byte_Variable123, TDelegate<void(float Slider_Value)> K2Node_CreateDelegate_OutputDelegate12345, int32 K2Node_CustomEvent_Tab_Id123456, int32 K2Node_CustomEvent_Tab_Id12345, int32 K2Node_CustomEvent_Tab_Id1234, int32 K2Node_CustomEvent_Tab_Id123, int32 K2Node_CustomEvent_Tab_Id12, int32 K2Node_CustomEvent_Tab_Id1, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 K2Node_CustomEvent_Selected_Index123456, bool CallFunc_IsWindowedFullscreen_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, int32 K2Node_CustomEvent_Selected_Index12345, ESlateVisibility K2Node_Select_Default, int32 K2Node_CustomEvent_Selected_Index1234, TDelegate<void(int32 Selected_Index)> K2Node_CreateDelegate_OutputDelegate123456, int32 CallFunc_GetCurrentDisplayResolution_ReturnValue, TDelegate<void(int32 Selected_Index)> K2Node_CreateDelegate_OutputDelegate1234567, TDelegate<void(int32 Selected_Index)> K2Node_CreateDelegate_OutputDelegate12345678, int32 K2Node_CustomEvent_Tab_Id, TDelegate<void(int32 Tab_Id)> K2Node_CreateDelegate_OutputDelegate123456789, int32 K2Node_CustomEvent_Selected_Index123, bool CallFunc_Conv_IntToBool_ReturnValue, int32 K2Node_CustomEvent_Selected_Index12, bool CallFunc_Conv_IntToBool_ReturnValue1, int32 K2Node_CustomEvent_Selected_Index1, bool CallFunc_Conv_IntToBool_ReturnValue12, int32 K2Node_CustomEvent_Selected_Index, bool CallFunc_Conv_IntToBool_ReturnValue123, TDelegate<void(int32 Tab_Id)> K2Node_CreateDelegate_OutputDelegate12345678910, TDelegate<void(int32 Tab_Id)> K2Node_CreateDelegate_OutputDelegate1234567891011, TDelegate<void(int32 Tab_Id)> K2Node_CreateDelegate_OutputDelegate123456789101112, TDelegate<void(int32 Tab_Id)> K2Node_CreateDelegate_OutputDelegate12345678910111213, TDelegate<void(int32 Tab_Id)> K2Node_CreateDelegate_OutputDelegate1234567891011121314, bool K2Node_Event_IsDesignTime, const class FString& CallFunc_MakeLiteralString_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, bool CallFunc_IsAthena_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue1, ESlateVisibility K2Node_Select1_Default, bool CallFunc_IsBROnly_ReturnValue);
	void ThreeD_Resolution_Changed(float Slider_Value);
	void PreConstruct(bool IsDesignTime);
	void CustomEvent_1(int32 Selected_Index);
	void CustomEvent(int32 Selected_Index);
	void Motion_Blur_Changed(int32 Selected_Index);
	void VSync_Changed(int32 Selected_Index);
	void CenterOnTab();
	void Construct();
	void View_Distance_Changed(int32 Tab_Id);
	void CustomEvent_23(int32 Selected_Index);
	void CustomEvent_22(int32 Selected_Index);
	void Window_Mode__Changed(int32 Selected_Index);
	void UpdateOptionsTab();
	void Quality_Changed(int32 Tab_Id);
	void Effects_Changed(int32 Tab_Id);
	void PostMinusProcessing_Changed(int32 Tab_Id);
	void Textures_Changed(int32 Tab_Id);
	void AntiMinusAliasing_Changed(int32 Tab_Id);
	void Shadows_Changed(int32 Tab_Id);
	void Initialize_Data(const TArray<class FText>& NewLocalVar_0, TArray<class FText>& K2Node_MakeArray_Array, TArray<class FText>& K2Node_MakeArray_Array1, TArray<class FText>& K2Node_MakeArray_Array12, TArray<class FText>& K2Node_MakeArray_Array123, class FText CallFunc_MakeLiteralText_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue1, class FText CallFunc_MakeLiteralText_ReturnValue12, class FText CallFunc_MakeLiteralText_ReturnValue123, class FText CallFunc_MakeLiteralText_ReturnValue1234, class FText CallFunc_MakeLiteralText_ReturnValue12345, class FText CallFunc_MakeLiteralText_ReturnValue123456, class FText CallFunc_MakeLiteralText_ReturnValue1234567, class FText CallFunc_MakeLiteralText_ReturnValue12345678, class FText CallFunc_MakeLiteralText_ReturnValue123456789, TArray<class FText>& CallFunc_GetPossibleFPS_ReturnValue, TArray<class FText>& CallFunc_GetPossibleWindowModes_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue12345678910, class FText CallFunc_MakeLiteralText_ReturnValue1234567891011, TArray<class FText>& K2Node_MakeArray_Array1234, TArray<class FText>& K2Node_MakeArray_Array12345, class FText CallFunc_MakeLiteralText_ReturnValue123456789101112, TArray<class FText>& K2Node_MakeArray_Array123456, TArray<class FText>& K2Node_MakeArray_Array1234567, TArray<class FText>& K2Node_MakeArray_Array12345678, TArray<class FText>& K2Node_MakeArray_Array123456789, TArray<class FText>& K2Node_MakeArray_Array12345678910, TArray<class FText>& K2Node_MakeArray_Array1234567891011, TArray<class FText>& K2Node_MakeArray_Array123456789101112, class FText CallFunc_MakeLiteralText_ReturnValue12345678910111213, TArray<class FText>& K2Node_MakeArray_Array12345678910111213, class FText CallFunc_MakeLiteralText_ReturnValue1234567891011121314, TArray<class FText>& K2Node_MakeArray_Array1234567891011121314, class FText CallFunc_MakeLiteralText_ReturnValue123456789101112131415, TArray<class FText>& K2Node_MakeArray_Array123456789101112131415, class FText CallFunc_MakeLiteralText_ReturnValue12345678910111213141516, TArray<class FText>& K2Node_MakeArray_Array12345678910111213141516, class FText CallFunc_MakeLiteralText_ReturnValue1234567891011121314151617, TArray<class FText>& K2Node_MakeArray_Array1234567891011121314151617, class FText CallFunc_MakeLiteralText_ReturnValue123456789101112131415161718);
	void Update_Data(bool Reset_Quality_Selector, class FText CallFunc_MakeLiteralText_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue1, int32 CallFunc_GetOverallQualityLevel_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, int32 CallFunc_GetCurrentFPS_ReturnValue, bool CallFunc_IsWindowedFullscreen_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsBROnly_ReturnValue, int32 CallFunc_GetCurrentDisplayResolution_ReturnValue, int32 CallFunc_GetCurrentWindowMode_ReturnValue, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable1, bool Temp_bool_Variable, bool CallFunc_GetShowFPS_ReturnValue, int32 CallFunc_Conv_BoolToInt_ReturnValue, ESlateVisibility K2Node_Select_Default, bool CallFunc_GetShowGrass_ReturnValue, int32 CallFunc_Conv_BoolToInt_ReturnValue1, bool CallFunc_GetMotionBlur_ReturnValue, bool CallFunc_GetUseVsync_ReturnValue, int32 CallFunc_Conv_BoolToInt_ReturnValue12, int32 CallFunc_Conv_BoolToInt_ReturnValue123, int32 CallFunc_GetPostProcessQuality_ReturnValue, int32 CallFunc_GetEffectsQuality_ReturnValue, int32 CallFunc_GetTextureQuality_ReturnValue, int32 CallFunc_GetAntiAliasingQuality_ReturnValue, int32 CallFunc_GetShadowQuality_ReturnValue, int32 CallFunc_GetViewDistanceQuality_ReturnValue);
	void Initialize_Display_Resolutions(class FText CallFunc_MakeLiteralText_ReturnValue, TArray<class FText>& CallFunc_GetPossibleDisplayResolutions_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TabVideoOptions_C">();
	}
	static class UTabVideoOptions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTabVideoOptions_C>();
	}
};

}

